; ModuleID = '.main.o.bc'
source_filename = "main.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.options = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i8*, i32, i32, i8**, i8**, i8**, i8**, i8**, i8**, i32, i32, i8*, %struct.__sFILE*, i32, i8*, i8*, i32, i32, i32, i8*, i8*, i8*, i32, i32, i8*, i8*, i8**, i8*, i8*, i8*, i64, i64, i32, i64, i64, i32, i32, i32, i32, i32, i32, i8*, i32, i32, i32, i64, i32, i32, i32 }

@.str = private unnamed_addr constant [10 x i8] c"sensitive\00", section "llvm.metadata"
@.str.1 = private unnamed_addr constant [7 x i8] c"main.c\00", section "llvm.metadata"

!22 = !DIEnumerator(name: "NEWLOCATION", value: 5, isUnsigned: true)
!23 = !DIEnumerator(name: "NOTENOUGHMEM", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "CONPORTERR", value: 7, isUnsigned: true)
!25 = !DIEnumerator(name: "BINDERR", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "BINDOK", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "LISTENERR", value: 10, isUnsigned: true)
!28 = !DIEnumerator(name: "ACCEPTERR", value: 11, isUnsigned: true)
!29 = !DIEnumerator(name: "ACCEPTOK", value: 12, isUnsigned: true)
!30 = !DIEnumerator(name: "CONCLOSED", value: 13, isUnsigned: true)
!31 = !DIEnumerator(name: "FTPOK", value: 14, isUnsigned: true)
!32 = !DIEnumerator(name: "FTPLOGINC", value: 15, isUnsigned: true)
!33 = !DIEnumerator(name: "FTPLOGREFUSED", value: 16, isUnsigned: true)
!34 = !DIEnumerator(name: "FTPPORTERR", value: 17, isUnsigned: true)
!35 = !DIEnumerator(name: "FTPNSFOD", value: 18, isUnsigned: true)
!36 = !DIEnumerator(name: "FTPRETROK", value: 19, isUnsigned: true)
!37 = !DIEnumerator(name: "FTPUNKNOWNTYPE", value: 20, isUnsigned: true)
!38 = !DIEnumerator(name: "FTPRERR", value: 21, isUnsigned: true)
!39 = !DIEnumerator(name: "FTPREXC", value: 22, isUnsigned: true)
!40 = !DIEnumerator(name: "FTPSRVERR", value: 23, isUnsigned: true)
!41 = !DIEnumerator(name: "FTPRETRINT", value: 24, isUnsigned: true)
!42 = !DIEnumerator(name: "FTPRESTFAIL", value: 25, isUnsigned: true)
!43 = !DIEnumerator(name: "URLOK", value: 26, isUnsigned: true)
!44 = !DIEnumerator(name: "URLHTTP", value: 27, isUnsigned: true)
!45 = !DIEnumerator(name: "URLFTP", value: 28, isUnsigned: true)
!46 = !DIEnumerator(name: "URLFILE", value: 29, isUnsigned: true)
!47 = !DIEnumerator(name: "URLUNKNOWN", value: 30, isUnsigned: true)
!48 = !DIEnumerator(name: "URLBADPORT", value: 31, isUnsigned: true)
!49 = !DIEnumerator(name: "URLBADHOST", value: 32, isUnsigned: true)
!50 = !DIEnumerator(name: "FOPENERR", value: 33, isUnsigned: true)
!51 = !DIEnumerator(name: "FWRITEERR", value: 34, isUnsigned: true)
!52 = !DIEnumerator(name: "HOK", value: 35, isUnsigned: true)
!53 = !DIEnumerator(name: "HLEXC", value: 36, isUnsigned: true)
!54 = !DIEnumerator(name: "HEOF", value: 37, isUnsigned: true)
!55 = !DIEnumerator(name: "HERR", value: 38, isUnsigned: true)
!56 = !DIEnumerator(name: "RETROK", value: 39, isUnsigned: true)
!57 = !DIEnumerator(name: "RECLEVELEXC", value: 40, isUnsigned: true)
!58 = !DIEnumerator(name: "FTPACCDENIED", value: 41, isUnsigned: true)
!59 = !DIEnumerator(name: "WRONGCODE", value: 42, isUnsigned: true)
!60 = !DIEnumerator(name: "FTPINVPASV", value: 43, isUnsigned: true)
!61 = !DIEnumerator(name: "FTPNOPASV", value: 44, isUnsigned: true)
!62 = !DIEnumerator(name: "RETRFINISHED", value: 45, isUnsigned: true)
!63 = !DIEnumerator(name: "READERR", value: 46, isUnsigned: true)
!64 = !DIEnumerator(name: "TRYLIMEXC", value: 47, isUnsigned: true)
!65 = !DIEnumerator(name: "URLBADPATTERN", value: 48, isUnsigned: true)
!66 = !DIEnumerator(name: "FILEBADFILE", value: 49, isUnsigned: true)
!67 = !DIEnumerator(name: "RANGEERR", value: 50, isUnsigned: true)
!68 = !DIEnumerator(name: "RETRBADPATTERN", value: 51, isUnsigned: true)
!69 = !DIEnumerator(name: "RETNOTSUP", value: 52, isUnsigned: true)
!70 = !DIEnumerator(name: "ROBOTSOK", value: 53, isUnsigned: true)
!71 = !DIEnumerator(name: "NOROBOTS", value: 54, isUnsigned: true)
!72 = !DIEnumerator(name: "PROXERR", value: 55, isUnsigned: true)
!73 = !DIEnumerator(name: "AUTHFAILED", value: 56, isUnsigned: true)
!74 = !DIEnumerator(name: "QUOTEXC", value: 57, isUnsigned: true)
!75 = !DIEnumerator(name: "WRITEFAILED", value: 58, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 173, baseType: !15, size: 32, elements: !77)
!77 = !{!78, !79, !80, !81, !82}
!78 = !DIEnumerator(name: "TEXTHTML", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "RETROKF", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "HEAD_ONLY", value: 4, isUnsigned: true)
!81 = !DIEnumerator(name: "SEND_NOCACHE", value: 8, isUnsigned: true)
!82 = !DIEnumerator(name: "ACCEPTRANGES", value: 16, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_options", file: !14, line: 88, baseType: !15, size: 32, elements: !84)
!84 = !{!85, !86, !87, !88}
!85 = !DIEnumerator(name: "LOG_VERBOSE", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "LOG_NOTQUIET", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "LOG_NONVERBOSE", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "LOG_ALWAYS", value: 3, isUnsigned: true)
!89 = !{!90, !91, !9, !92, !93}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !6}
!96 = !{!0, !97, !232}
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "opt", scope: !11, file: !3, line: 63, type: !99, isLocal: false, isDefinition: true)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "options", file: !100, line: 23, size: 3328, elements: !101)
!100 = !DIFile(filename: "./options.h", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!101 = !{!102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !99, file: !100, line: 25, baseType: !6, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !99, file: !100, line: 26, baseType: !6, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ntry", scope: !99, file: !100, line: 27, baseType: !6, size: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !99, file: !100, line: 28, baseType: !6, size: 32, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "kill_longer", scope: !99, file: !100, line: 29, baseType: !6, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_length", scope: !99, file: !100, line: 32, baseType: !6, size: 32, offset: 160)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !99, file: !100, line: 33, baseType: !6, size: 32, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "spanhost", scope: !99, file: !100, line: 34, baseType: !6, size: 32, offset: 224)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "relative_only", scope: !99, file: !100, line: 36, baseType: !6, size: 32, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "no_parent", scope: !99, file: !100, line: 37, baseType: !6, size: 32, offset: 288)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "simple_check", scope: !99, file: !100, line: 39, baseType: !6, size: 32, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "reclevel", scope: !99, file: !100, line: 42, baseType: !6, size: 32, offset: 352)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "dirstruct", scope: !99, file: !100, line: 43, baseType: !6, size: 32, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "no_dirstruct", scope: !99, file: !100, line: 45, baseType: !6, size: 32, offset: 416)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "cut_dirs", scope: !99, file: !100, line: 46, baseType: !6, size: 32, offset: 448)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "add_hostdir", scope: !99, file: !100, line: 47, baseType: !6, size: 32, offset: 480)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "noclobber", scope: !99, file: !100, line: 48, baseType: !6, size: 32, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "dir_prefix", scope: !99, file: !100, line: 50, baseType: !9, size: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "lfilename", scope: !99, file: !100, line: 51, baseType: !9, size: 64, offset: 640)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "no_flush", scope: !99, file: !100, line: 52, baseType: !6, size: 32, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "input_filename", scope: !99, file: !100, line: 53, baseType: !9, size: 64, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "force_html", scope: !99, file: !100, line: 54, baseType: !6, size: 32, offset: 832)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "spider", scope: !99, file: !100, line: 56, baseType: !6, size: 32, offset: 864)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "accepts", scope: !99, file: !100, line: 58, baseType: !91, size: 64, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "rejects", scope: !99, file: !100, line: 59, baseType: !91, size: 64, offset: 960)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "excludes", scope: !99, file: !100, line: 60, baseType: !91, size: 64, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "includes", scope: !99, file: !100, line: 61, baseType: !91, size: 64, offset: 1088)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "domains", scope: !99, file: !100, line: 64, baseType: !91, size: 64, offset: 1152)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_domains", scope: !99, file: !100, line: 65, baseType: !91, size: 64, offset: 1216)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "follow_ftp", scope: !99, file: !100, line: 67, baseType: !6, size: 32, offset: 1280)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "retr_symlinks", scope: !99, file: !100, line: 69, baseType: !6, size: 32, offset: 1312)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "output_document", scope: !99, file: !100, line: 71, baseType: !9, size: 64, offset: 1344)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "dfp", scope: !99, file: !100, line: 73, baseType: !135, size: 64, offset: 1408)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !137, line: 157, baseType: !138)
!137 = !DIFile(filename: "/usr/include/_stdio.h", directory: "")
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !137, line: 126, size: 1216, elements: !139)
!139 = !{!140, !143, !144, !145, !147, !148, !153, !154, !155, !159, !163, !173, !179, !180, !183, !184, !188, !192, !193, !194}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !138, file: !137, line: 127, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !138, file: !137, line: 128, baseType: !6, size: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !138, file: !137, line: 129, baseType: !6, size: 32, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !138, file: !137, line: 130, baseType: !146, size: 16, offset: 128)
!146 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !138, file: !137, line: 131, baseType: !146, size: 16, offset: 144)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !138, file: !137, line: 132, baseType: !149, size: 128, offset: 192)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !137, line: 92, size: 128, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !149, file: !137, line: 93, baseType: !141, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !149, file: !137, line: 94, baseType: !6, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !138, file: !137, line: 133, baseType: !6, size: 32, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !138, file: !137, line: 136, baseType: !92, size: 64, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !138, file: !137, line: 137, baseType: !156, size: 64, offset: 448)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!6, !92}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !138, file: !137, line: 138, baseType: !160, size: 64, offset: 512)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!6, !92, !9, !6}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !138, file: !137, line: 139, baseType: !164, size: 64, offset: 576)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!167, !92, !167, !6}
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !137, line: 81, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !169, line: 71, baseType: !170)
!169 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "")
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !171, line: 46, baseType: !172)
!171 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "")
!172 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !138, file: !137, line: 140, baseType: !174, size: 64, offset: 640)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!6, !92, !177, !6}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !138, file: !137, line: 143, baseType: !149, size: 128, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !138, file: !137, line: 144, baseType: !181, size: 64, offset: 832)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !137, line: 98, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !138, file: !137, line: 145, baseType: !6, size: 32, offset: 896)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !138, file: !137, line: 148, baseType: !185, size: 24, offset: 928)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 24, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 3)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !138, file: !137, line: 149, baseType: !189, size: 8, offset: 952)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 8, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 1)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !138, file: !137, line: 152, baseType: !149, size: 128, offset: 960)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !138, file: !137, line: 155, baseType: !6, size: 32, offset: 1088)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !138, file: !137, line: 156, baseType: !167, size: 64, offset: 1152)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "always_rest", scope: !99, file: !100, line: 76, baseType: !6, size: 32, offset: 1472)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_acc", scope: !99, file: !100, line: 77, baseType: !9, size: 64, offset: 1536)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_pass", scope: !99, file: !100, line: 78, baseType: !9, size: 64, offset: 1600)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "netrc", scope: !99, file: !100, line: 79, baseType: !6, size: 32, offset: 1664)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_glob", scope: !99, file: !100, line: 80, baseType: !6, size: 32, offset: 1696)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_pasv", scope: !99, file: !100, line: 81, baseType: !6, size: 32, offset: 1728)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "http_user", scope: !99, file: !100, line: 83, baseType: !9, size: 64, offset: 1792)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "http_passwd", scope: !99, file: !100, line: 84, baseType: !9, size: 64, offset: 1856)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "user_header", scope: !99, file: !100, line: 85, baseType: !9, size: 64, offset: 1920)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "use_proxy", scope: !99, file: !100, line: 87, baseType: !6, size: 32, offset: 1984)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_cache", scope: !99, file: !100, line: 88, baseType: !6, size: 32, offset: 2016)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "http_proxy", scope: !99, file: !100, line: 89, baseType: !9, size: 64, offset: 2048)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_proxy", scope: !99, file: !100, line: 89, baseType: !9, size: 64, offset: 2112)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "no_proxy", scope: !99, file: !100, line: 90, baseType: !91, size: 64, offset: 2176)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "base_href", scope: !99, file: !100, line: 91, baseType: !9, size: 64, offset: 2240)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_user", scope: !99, file: !100, line: 92, baseType: !9, size: 64, offset: 2304)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_passwd", scope: !99, file: !100, line: 93, baseType: !9, size: 64, offset: 2368)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !99, file: !100, line: 95, baseType: !213, size: 64, offset: 2432)
!213 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !99, file: !100, line: 98, baseType: !213, size: 64, offset: 2496)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "use_robots", scope: !99, file: !100, line: 99, baseType: !6, size: 32, offset: 2560)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "quota", scope: !99, file: !100, line: 101, baseType: !213, size: 64, offset: 2624)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "downloaded", scope: !99, file: !100, line: 103, baseType: !213, size: 64, offset: 2688)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "numurls", scope: !99, file: !100, line: 104, baseType: !6, size: 32, offset: 2752)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "server_response", scope: !99, file: !100, line: 107, baseType: !6, size: 32, offset: 2784)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "save_headers", scope: !99, file: !100, line: 108, baseType: !6, size: 32, offset: 2816)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !99, file: !100, line: 112, baseType: !6, size: 32, offset: 2848)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "timestamping", scope: !99, file: !100, line: 115, baseType: !6, size: 32, offset: 2880)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "backups", scope: !99, file: !100, line: 116, baseType: !6, size: 32, offset: 2912)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "useragent", scope: !99, file: !100, line: 118, baseType: !9, size: 64, offset: 2944)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "convert_links", scope: !99, file: !100, line: 121, baseType: !6, size: 32, offset: 3008)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "remove_listing", scope: !99, file: !100, line: 123, baseType: !6, size: 32, offset: 3040)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "htmlify", scope: !99, file: !100, line: 125, baseType: !6, size: 32, offset: 3072)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "dot_bytes", scope: !99, file: !100, line: 128, baseType: !213, size: 64, offset: 3136)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "dots_in_line", scope: !99, file: !100, line: 130, baseType: !6, size: 32, offset: 3200)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "dot_spacing", scope: !99, file: !100, line: 131, baseType: !6, size: 32, offset: 3232)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "delete_after", scope: !99, file: !100, line: 133, baseType: !6, size: 32, offset: 3264)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "exec_name", scope: !11, file: !3, line: 72, type: !177, isLocal: false, isDefinition: true)
!234 = !{}
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 16896, elements: !243)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !237, line: 77, size: 256, elements: !238)
!237 = !DIFile(filename: "./getopt.h", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!238 = !{!239, !240, !241, !242}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !236, file: !237, line: 80, baseType: !177, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !236, file: !237, line: 86, baseType: !6, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !236, file: !237, line: 87, baseType: !90, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !236, file: !237, line: 88, baseType: !6, size: 32, offset: 192)
!243 = !{!244}
!244 = !DISubrange(count: 66)
!245 = !{i32 7, !"Dwarf Version", i32 4}
!246 = !{i32 2, !"Debug Info Version", i32 3}
!247 = !{i32 1, !"wchar_size", i32 4}
!248 = !{i32 7, !"PIC Level", i32 2}
!249 = !{!"clang version 10.0.0 "}
!250 = !DILocalVariable(name: "argc", arg: 1, scope: !2, file: !3, line: 195, type: !6)
!251 = !DILocation(line: 195, column: 11, scope: !2)
!252 = !DILocalVariable(name: "argv", arg: 2, scope: !2, file: !3, line: 195, type: !7)
!253 = !DILocation(line: 195, column: 30, scope: !2)
!254 = !DILocalVariable(name: "url", scope: !2, file: !3, line: 197, type: !91)
!255 = !DILocation(line: 197, column: 49, scope: !2)
!256 = !DILocation(line: 197, column: 3, scope: !2)
!257 = !DILocalVariable(name: "t", scope: !2, file: !3, line: 197, type: !91)
!258 = !DILocation(line: 197, column: 56, scope: !2)
!259 = !DILocalVariable(name: "i", scope: !2, file: !3, line: 198, type: !6)
!260 = !DILocation(line: 198, column: 7, scope: !2)
!261 = !DILocalVariable(name: "c", scope: !2, file: !3, line: 198, type: !6)
!262 = !DILocation(line: 198, column: 10, scope: !2)
!263 = !DILocalVariable(name: "nurl", scope: !2, file: !3, line: 198, type: !6)
!264 = !DILocation(line: 198, column: 13, scope: !2)
!265 = !DILocalVariable(name: "status", scope: !2, file: !3, line: 198, type: !6)
!266 = !DILocation(line: 198, column: 19, scope: !2)
!267 = !DILocalVariable(name: "append_to_log", scope: !2, file: !3, line: 198, type: !6)
!268 = !DILocation(line: 198, column: 27, scope: !2)
!269 = !DILocation(line: 271, column: 3, scope: !2)
!270 = !DILocation(line: 273, column: 17, scope: !2)
!271 = !DILocation(line: 276, column: 24, scope: !2)
!272 = !DILocation(line: 276, column: 15, scope: !2)
!273 = !DILocation(line: 276, column: 13, scope: !2)
!274 = !DILocation(line: 277, column: 8, scope: !275)
!275 = distinct !DILexicalBlock(scope: !2, file: !3, line: 277, column: 7)
!276 = !DILocation(line: 277, column: 7, scope: !2)
!277 = !DILocation(line: 278, column: 17, scope: !275)
!278 = !DILocation(line: 278, column: 15, scope: !275)
!279 = !DILocation(line: 278, column: 5, scope: !275)
!280 = !DILocation(line: 280, column: 5, scope: !275)
!281 = !DILocation(line: 286, column: 3, scope: !2)
!282 = !DILocation(line: 288, column: 3, scope: !2)
!283 = !DILocation(line: 288, column: 28, scope: !2)
!284 = !DILocation(line: 288, column: 34, scope: !2)
!285 = !DILocation(line: 288, column: 15, scope: !2)
!286 = !DILocation(line: 288, column: 13, scope: !2)
!287 = !DILocation(line: 290, column: 32, scope: !2)
!288 = !DILocation(line: 292, column: 15, scope: !289)
!289 = distinct !DILexicalBlock(scope: !2, file: !3, line: 291, column: 5)
!290 = !DILocation(line: 292, column: 7, scope: !289)
!291 = !DILocation(line: 296, column: 4, scope: !292)
!292 = distinct !DILexicalBlock(scope: !289, file: !3, line: 293, column: 2)
!293 = !DILocation(line: 297, column: 4, scope: !292)
!294 = !DILocation(line: 299, column: 4, scope: !292)
!295 = !DILocation(line: 300, column: 4, scope: !292)
!296 = !DILocation(line: 302, column: 4, scope: !292)
!297 = !DILocation(line: 303, column: 4, scope: !292)
!298 = !DILocation(line: 305, column: 4, scope: !292)
!299 = !DILocation(line: 306, column: 4, scope: !292)
!300 = !DILocation(line: 308, column: 4, scope: !292)
!301 = !DILocation(line: 309, column: 4, scope: !292)
!302 = !DILocation(line: 311, column: 4, scope: !292)
!303 = !DILocation(line: 312, column: 4, scope: !292)
!304 = !DILocation(line: 314, column: 4, scope: !292)
!305 = !DILocation(line: 315, column: 4, scope: !292)
!306 = !DILocation(line: 317, column: 4, scope: !292)
!307 = !DILocation(line: 318, column: 4, scope: !292)
!308 = !DILocation(line: 320, column: 23, scope: !292)
!309 = !DILocation(line: 320, column: 4, scope: !292)
!310 = !DILocation(line: 321, column: 4, scope: !292)
!311 = !DILocation(line: 323, column: 4, scope: !292)
