; ModuleID = 'wget.bc'
source_filename = "llvm-link"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct.sockaddr_in = type { i8, i8, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.sockaddr = type { i8, i8, [14 x i8] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.host = type { i8*, i8*, i32, %struct.host* }
%struct.state_t = type { i32, i32, i8, i8*, i8*, i8* }
%struct.tag_attr = type { i8*, i8* }
%struct.anon = type { i8*, i8** }
%struct.anon.43 = type { i8*, i8*, i32 (i8*, i8*, i8*)* }
%struct.options = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i8*, i32, i32, i8**, i8**, i8**, i8**, i8**, i8**, i32, i32, i8*, %struct.__sFILE*, i32, i8*, i8*, i32, i32, i32, i8*, i8*, i8*, i32, i32, i8*, i8*, i8**, i8*, i8*, i8*, i64, i64, i32, i64, i64, i32, i32, i32, i32, i32, i32, i8*, i32, i32, i32, i64, i32, i32, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct._acc_t = type { i8*, i8*, i8*, %struct._acc_t* }
%struct._slist = type { i8*, %struct._slist* }
%struct._urlpos = type { i8*, i8*, i32, i32, i32, %struct._urlpos* }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !68, globals: !96, nameTableKind: None)
!3 = !DIFile(filename: "connect.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 184, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./wget.h", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67}
!9 = !DIEnumerator(name: "NOCONERROR", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "HOSTERR", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "CONSOCKERR", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "CONERROR", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "CONREFUSED", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "NEWLOCATION", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "NOTENOUGHMEM", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "CONPORTERR", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "BINDERR", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "BINDOK", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "LISTENERR", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "ACCEPTERR", value: 11, isUnsigned: true)
!21 = !DIEnumerator(name: "ACCEPTOK", value: 12, isUnsigned: true)
!22 = !DIEnumerator(name: "CONCLOSED", value: 13, isUnsigned: true)
!23 = !DIEnumerator(name: "FTPOK", value: 14, isUnsigned: true)
!24 = !DIEnumerator(name: "FTPLOGINC", value: 15, isUnsigned: true)
!25 = !DIEnumerator(name: "FTPLOGREFUSED", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "FTPPORTERR", value: 17, isUnsigned: true)
!27 = !DIEnumerator(name: "FTPNSFOD", value: 18, isUnsigned: true)
!28 = !DIEnumerator(name: "FTPRETROK", value: 19, isUnsigned: true)
!29 = !DIEnumerator(name: "FTPUNKNOWNTYPE", value: 20, isUnsigned: true)
!30 = !DIEnumerator(name: "FTPRERR", value: 21, isUnsigned: true)
!31 = !DIEnumerator(name: "FTPREXC", value: 22, isUnsigned: true)
!32 = !DIEnumerator(name: "FTPSRVERR", value: 23, isUnsigned: true)
!33 = !DIEnumerator(name: "FTPRETRINT", value: 24, isUnsigned: true)
!34 = !DIEnumerator(name: "FTPRESTFAIL", value: 25, isUnsigned: true)
!35 = !DIEnumerator(name: "URLOK", value: 26, isUnsigned: true)
!36 = !DIEnumerator(name: "URLHTTP", value: 27, isUnsigned: true)
!37 = !DIEnumerator(name: "URLFTP", value: 28, isUnsigned: true)
!38 = !DIEnumerator(name: "URLFILE", value: 29, isUnsigned: true)
!39 = !DIEnumerator(name: "URLUNKNOWN", value: 30, isUnsigned: true)
!40 = !DIEnumerator(name: "URLBADPORT", value: 31, isUnsigned: true)
!41 = !DIEnumerator(name: "URLBADHOST", value: 32, isUnsigned: true)
!42 = !DIEnumerator(name: "FOPENERR", value: 33, isUnsigned: true)
!43 = !DIEnumerator(name: "FWRITEERR", value: 34, isUnsigned: true)
!44 = !DIEnumerator(name: "HOK", value: 35, isUnsigned: true)
!45 = !DIEnumerator(name: "HLEXC", value: 36, isUnsigned: true)
!46 = !DIEnumerator(name: "HEOF", value: 37, isUnsigned: true)
!47 = !DIEnumerator(name: "HERR", value: 38, isUnsigned: true)
!48 = !DIEnumerator(name: "RETROK", value: 39, isUnsigned: true)
!49 = !DIEnumerator(name: "RECLEVELEXC", value: 40, isUnsigned: true)
!50 = !DIEnumerator(name: "FTPACCDENIED", value: 41, isUnsigned: true)
!51 = !DIEnumerator(name: "WRONGCODE", value: 42, isUnsigned: true)
!52 = !DIEnumerator(name: "FTPINVPASV", value: 43, isUnsigned: true)
!53 = !DIEnumerator(name: "FTPNOPASV", value: 44, isUnsigned: true)
!54 = !DIEnumerator(name: "RETRFINISHED", value: 45, isUnsigned: true)
!55 = !DIEnumerator(name: "READERR", value: 46, isUnsigned: true)
!56 = !DIEnumerator(name: "TRYLIMEXC", value: 47, isUnsigned: true)
!57 = !DIEnumerator(name: "URLBADPATTERN", value: 48, isUnsigned: true)
!58 = !DIEnumerator(name: "FILEBADFILE", value: 49, isUnsigned: true)
!59 = !DIEnumerator(name: "RANGEERR", value: 50, isUnsigned: true)
!60 = !DIEnumerator(name: "RETRBADPATTERN", value: 51, isUnsigned: true)
!61 = !DIEnumerator(name: "RETNOTSUP", value: 52, isUnsigned: true)
!62 = !DIEnumerator(name: "ROBOTSOK", value: 53, isUnsigned: true)
!63 = !DIEnumerator(name: "NOROBOTS", value: 54, isUnsigned: true)
!64 = !DIEnumerator(name: "PROXERR", value: 55, isUnsigned: true)
!65 = !DIEnumerator(name: "AUTHFAILED", value: 56, isUnsigned: true)
!66 = !DIEnumerator(name: "QUOTEXC", value: 57, isUnsigned: true)
!67 = !DIEnumerator(name: "WRITEFAILED", value: 58, isUnsigned: true)
!68 = !{!69, !71, !74, !88, !89, !90, !92, !94, !95}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !72, line: 43, baseType: !73)
!72 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "")
!73 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !76, line: 407, size: 128, elements: !77)
!76 = !DIFile(filename: "/usr/include/sys/socket.h", directory: "")
!77 = !{!78, !80, !83}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "sa_len", scope: !75, file: !76, line: 408, baseType: !79, size: 8)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !72, line: 41, baseType: !70)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !75, file: !76, line: 409, baseType: !81, size: 8, offset: 8)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !82, line: 31, baseType: !79)
!82 = !DIFile(filename: "/usr/include/sys/_types/_sa_family_t.h", directory: "")
!83 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !75, file: !76, line: 410, baseType: !84, size: 112, offset: 16)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 112, elements: !86)
!85 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!86 = !{!87}
!87 = !DISubrange(count: 14)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !72, line: 45, baseType: !7)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32_t", file: !91, line: 30, baseType: !7)
!91 = !DIFile(filename: "/usr/include/sys/_types/_u_int32_t.h", directory: "")
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !72, line: 44, baseType: !93)
!95 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!96 = !{!97, !123, !131, !0}
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "srv", scope: !99, file: !3, line: 112, type: !105, isLocal: true, isDefinition: true)
!99 = distinct !DISubprogram(name: "bindport", scope: !3, file: !3, line: 109, type: !100, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !104)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "uerr_t", file: !6, line: 199, baseType: !5)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!104 = !{}
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !106, line: 375, size: 128, elements: !107)
!106 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!107 = !{!108, !109, !110, !113, !119}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "sin_len", scope: !105, file: !106, line: 376, baseType: !79, size: 8)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !105, file: !106, line: 377, baseType: !81, size: 8, offset: 8)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !105, file: !106, line: 378, baseType: !111, size: 16, offset: 16)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !112, line: 31, baseType: !71)
!112 = !DIFile(filename: "/usr/include/sys/_types/_in_port_t.h", directory: "")
!113 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !105, file: !106, line: 379, baseType: !114, size: 32, offset: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !106, line: 301, size: 32, elements: !115)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !114, file: !106, line: 302, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !118, line: 31, baseType: !89)
!118 = !DIFile(filename: "/usr/include/sys/_types/_in_addr_t.h", directory: "")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !105, file: !106, line: 380, baseType: !120, size: 64, offset: 64)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 64, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 8)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "res", scope: !125, file: !3, line: 214, type: !128, isLocal: true, isDefinition: true)
!125 = distinct !DISubprogram(name: "conaddr", scope: !3, file: !3, line: 212, type: !126, scopeLine: 213, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !104)
!126 = !DISubroutineType(types: !127)
!127 = !{!69, !93}
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 32, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 4)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "addr", scope: !2, file: !3, line: 57, type: !74, isLocal: true, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "ftp_last_respline", scope: !135, file: !136, line: 52, type: !180, isLocal: false, isDefinition: true)
!135 = distinct !DICompileUnit(language: DW_LANG_C99, file: !136, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !137, retainedTypes: !144, globals: !145, nameTableKind: None)
!136 = !DIFile(filename: "ftp-basic.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!137 = !{!5, !138}
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_options", file: !6, line: 88, baseType: !7, size: 32, elements: !139)
!139 = !{!140, !141, !142, !143}
!140 = !DIEnumerator(name: "LOG_VERBOSE", value: 0, isUnsigned: true)
!141 = !DIEnumerator(name: "LOG_NOTQUIET", value: 1, isUnsigned: true)
!142 = !DIEnumerator(name: "LOG_NONVERBOSE", value: 2, isUnsigned: true)
!143 = !DIEnumerator(name: "LOG_ALWAYS", value: 3, isUnsigned: true)
!144 = !{!88, !70, !7}
!145 = !{!146, !171, !133}
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "skey_head", scope: !148, file: !136, line: 180, type: !168, isLocal: true, isDefinition: true)
!148 = distinct !DISubprogram(name: "ftp_login", scope: !136, file: !136, line: 131, type: !149, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !135, retainedNodes: !104)
!149 = !DISubroutineType(types: !150)
!150 = !{!102, !151, !166, !166}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbuf", file: !153, line: 24, size: 33024, elements: !154)
!153 = !DIFile(filename: "./rbuf.h", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!154 = !{!155, !156, !160, !161, !165}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !152, file: !153, line: 26, baseType: !93, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !152, file: !153, line: 27, baseType: !157, size: 32768, offset: 32)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 32768, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 4096)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pos", scope: !152, file: !153, line: 28, baseType: !88, size: 64, offset: 32832)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_left", scope: !152, file: !153, line: 29, baseType: !162, size: 64, offset: 32896)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !163, line: 31, baseType: !164)
!163 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "")
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !72, line: 92, baseType: !95)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "internal_dont_touch_this", scope: !152, file: !153, line: 31, baseType: !93, size: 32, offset: 32960)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 128, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 2)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "numbuf", scope: !173, file: !136, line: 434, type: !177, isLocal: true, isDefinition: true)
!173 = distinct !DISubprogram(name: "ftp_rest", scope: !136, file: !136, line: 429, type: !174, scopeLine: 430, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !135, retainedNodes: !104)
!174 = !DISubroutineType(types: !175)
!175 = !{!102, !151, !176}
!176 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 160, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 20)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 1024, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 128)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "months", scope: !185, file: !186, line: 72, type: !211, isLocal: true, isDefinition: true)
!185 = distinct !DISubprogram(name: "ftp_parse_unix_ls", scope: !186, file: !186, line: 69, type: !187, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, retainedNodes: !104)
!186 = !DIFile(filename: "ftp-ls.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!187 = !DISubroutineType(types: !188)
!188 = !{!189, !166}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fileinfo", file: !191, line: 53, size: 512, elements: !192)
!191 = !DIFile(filename: "./ftp.h", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!192 = !{!193, !200, !201, !202, !203, !204, !205, !206}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !190, file: !191, line: 55, baseType: !194, size: 32)
!194 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ftype", file: !191, line: 37, baseType: !7, size: 32, elements: !195)
!195 = !{!196, !197, !198, !199}
!196 = !DIEnumerator(name: "FT_PLAINFILE", value: 0, isUnsigned: true)
!197 = !DIEnumerator(name: "FT_DIRECTORY", value: 1, isUnsigned: true)
!198 = !DIEnumerator(name: "FT_SYMLINK", value: 2, isUnsigned: true)
!199 = !DIEnumerator(name: "FT_UNKNOWN", value: 3, isUnsigned: true)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !190, file: !191, line: 56, baseType: !88, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !190, file: !191, line: 57, baseType: !176, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !190, file: !191, line: 58, baseType: !176, size: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !190, file: !191, line: 59, baseType: !93, size: 32, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "linkto", scope: !190, file: !191, line: 60, baseType: !88, size: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !190, file: !191, line: 61, baseType: !189, size: 64, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !191, line: 62, baseType: !189, size: 64, offset: 448)
!207 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !209, globals: !210, nameTableKind: None)
!208 = !{!194, !138}
!209 = !{!70, !88, !189}
!210 = !{!183}
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 768, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 12)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "buf", scope: !216, file: !217, line: 2151, type: !228, isLocal: true, isDefinition: true)
!216 = distinct !DISubprogram(name: "calculate_skey_response", scope: !217, file: !217, line: 2148, type: !218, scopeLine: 2149, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !220, retainedNodes: !104)
!217 = !DIFile(filename: "ftp-opie.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!218 = !DISubroutineType(types: !219)
!219 = !{!166, !93, !166, !166}
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !104, retainedTypes: !221, globals: !222, nameTableKind: None)
!221 = !{!88, !85, !176}
!222 = !{!214, !223}
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "Wp", scope: !220, file: !217, line: 34, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 65536, elements: !226)
!226 = !{!227, !130}
!227 = !DISubrange(count: 2048)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 264, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 33)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "first_retrieval", scope: !233, file: !234, line: 816, type: !93, isLocal: true, isDefinition: true)
!233 = distinct !DISubprogram(name: "ftp_loop_internal", scope: !234, file: !234, line: 814, type: !235, scopeLine: 815, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !280, retainedNodes: !104)
!234 = !DIFile(filename: "ftp.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!235 = !DISubroutineType(types: !236)
!236 = !{!102, !237, !254, !265}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "urlinfo", file: !239, line: 28, size: 768, elements: !240)
!239 = !DIFile(filename: "./url.h", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !238, file: !239, line: 30, baseType: !88, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !238, file: !239, line: 31, baseType: !102, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !238, file: !239, line: 32, baseType: !88, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !238, file: !239, line: 33, baseType: !73, size: 16, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_type", scope: !238, file: !239, line: 34, baseType: !85, size: 8, offset: 208)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !238, file: !239, line: 35, baseType: !88, size: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !238, file: !239, line: 35, baseType: !88, size: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !238, file: !239, line: 35, baseType: !88, size: 64, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !238, file: !239, line: 37, baseType: !88, size: 64, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "passwd", scope: !238, file: !239, line: 37, baseType: !88, size: 64, offset: 512)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !238, file: !239, line: 38, baseType: !237, size: 64, offset: 576)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !238, file: !239, line: 40, baseType: !88, size: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !238, file: !239, line: 42, baseType: !88, size: 64, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fileinfo", file: !191, line: 53, size: 512, elements: !256)
!256 = !{!257, !258, !259, !260, !261, !262, !263, !264}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !255, file: !191, line: 55, baseType: !194, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !255, file: !191, line: 56, baseType: !88, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !255, file: !191, line: 57, baseType: !176, size: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !255, file: !191, line: 58, baseType: !176, size: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !255, file: !191, line: 59, baseType: !93, size: 32, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "linkto", scope: !255, file: !191, line: 60, baseType: !88, size: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !255, file: !191, line: 61, baseType: !254, size: 64, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !255, file: !191, line: 62, baseType: !254, size: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "ccon", file: !191, line: 90, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !191, line: 84, size: 33152, elements: !268)
!268 = !{!269, !270, !271, !279}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !267, file: !191, line: 86, baseType: !93, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !267, file: !191, line: 87, baseType: !93, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf", scope: !267, file: !191, line: 88, baseType: !272, size: 33024, offset: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbuf", file: !153, line: 24, size: 33024, elements: !273)
!273 = !{!274, !275, !276, !277, !278}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !272, file: !153, line: 26, baseType: !93, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !272, file: !153, line: 27, baseType: !157, size: 32768, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pos", scope: !272, file: !153, line: 28, baseType: !88, size: 64, offset: 32832)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_left", scope: !272, file: !153, line: 29, baseType: !162, size: 64, offset: 32896)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "internal_dont_touch_this", scope: !272, file: !153, line: 31, baseType: !93, size: 32, offset: 32960)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "dltime", scope: !267, file: !191, line: 89, baseType: !176, size: 64, offset: 33088)
!280 = distinct !DICompileUnit(language: DW_LANG_C99, file: !234, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !281, retainedTypes: !310, globals: !313, nameTableKind: None)
!281 = !{!5, !282, !194, !138, !287, !292, !299, !306}
!282 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fstatus", file: !191, line: 75, baseType: !7, size: 32, elements: !283)
!283 = !{!284, !285, !286}
!284 = !DIEnumerator(name: "NOTHING", value: 0, isUnsigned: true)
!285 = !DIEnumerator(name: "ON_YOUR_OWN", value: 1, isUnsigned: true)
!286 = !DIEnumerator(name: "DONE_CWD", value: 2, isUnsigned: true)
!287 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !191, line: 47, baseType: !7, size: 32, elements: !288)
!288 = !{!289, !290, !291}
!289 = !DIEnumerator(name: "GLOBALL", value: 0, isUnsigned: true)
!290 = !DIEnumerator(name: "GETALL", value: 1, isUnsigned: true)
!291 = !DIEnumerator(name: "GETONE", value: 2, isUnsigned: true)
!292 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 173, baseType: !7, size: 32, elements: !293)
!293 = !{!294, !295, !296, !297, !298}
!294 = !DIEnumerator(name: "TEXTHTML", value: 1, isUnsigned: true)
!295 = !DIEnumerator(name: "RETROKF", value: 2, isUnsigned: true)
!296 = !DIEnumerator(name: "HEAD_ONLY", value: 4, isUnsigned: true)
!297 = !DIEnumerator(name: "SEND_NOCACHE", value: 8, isUnsigned: true)
!298 = !DIEnumerator(name: "ACCEPTRANGES", value: 16, isUnsigned: true)
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "command", file: !191, line: 66, baseType: !7, size: 32, elements: !300)
!300 = !{!301, !302, !303, !304, !305}
!301 = !DIEnumerator(name: "DO_LOGIN", value: 1, isUnsigned: true)
!302 = !DIEnumerator(name: "DO_CWD", value: 2, isUnsigned: true)
!303 = !DIEnumerator(name: "DO_RETR", value: 4, isUnsigned: true)
!304 = !DIEnumerator(name: "DO_LIST", value: 8, isUnsigned: true)
!305 = !DIEnumerator(name: "LEAVE_PENDING", value: 16, isUnsigned: true)
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "accd", file: !307, line: 28, baseType: !7, size: 32, elements: !308)
!307 = !DIFile(filename: "./utils.h", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!308 = !{!309}
!309 = !DIEnumerator(name: "ALLABS", value: 1, isUnsigned: true)
!310 = !{!311, !88, !312, !70}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!313 = !{!314, !231}
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "depth", scope: !316, file: !234, line: 1037, type: !93, isLocal: true, isDefinition: true)
!316 = distinct !DISubprogram(name: "ftp_retrieve_list", scope: !234, file: !234, line: 1035, type: !235, scopeLine: 1036, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !280, retainedNodes: !104)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "optarg", scope: !319, file: !320, line: 89, type: !88, isLocal: false, isDefinition: true)
!319 = distinct !DICompileUnit(language: DW_LANG_C99, file: !320, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !321, retainedTypes: !327, globals: !338, nameTableKind: None)
!320 = !DIFile(filename: "getopt.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!321 = !{!322}
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !320, line: 155, baseType: !7, size: 32, elements: !323)
!323 = !{!324, !325, !326}
!324 = !DIEnumerator(name: "REQUIRE_ORDER", value: 0, isUnsigned: true)
!325 = !DIEnumerator(name: "PERMUTE", value: 1, isUnsigned: true)
!326 = !DIEnumerator(name: "RETURN_IN_ORDER", value: 2, isUnsigned: true)
!327 = !{!311, !328, !88, !329, !92}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !332, line: 77, size: 256, elements: !333)
!332 = !DIFile(filename: "./getopt.h", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!333 = !{!334, !335, !336, !337}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !331, file: !332, line: 80, baseType: !166, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !331, file: !332, line: 86, baseType: !93, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !331, file: !332, line: 87, baseType: !92, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !331, file: !332, line: 88, baseType: !93, size: 32, offset: 192)
!338 = !{!317, !339, !341, !343, !345, !347, !349, !351}
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "optind", scope: !319, file: !320, line: 104, type: !93, isLocal: false, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "opterr", scope: !319, file: !320, line: 118, type: !93, isLocal: false, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "optopt", scope: !319, file: !320, line: 124, type: !93, isLocal: false, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "nextchar", scope: !319, file: !320, line: 113, type: !88, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "ordering", scope: !319, file: !320, line: 158, type: !322, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "first_nonopt", scope: !319, file: !320, line: 202, type: !93, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "last_nonopt", scope: !319, file: !320, line: 203, type: !93, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "hlist", scope: !355, file: !356, line: 73, type: !358, isLocal: true, isDefinition: true)
!355 = distinct !DICompileUnit(language: DW_LANG_C99, file: !356, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !137, retainedTypes: !357, globals: !365, nameTableKind: None)
!356 = !DIFile(filename: "host.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!357 = !{!95, !93, !88, !311, !312, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "host", file: !356, line: 57, size: 256, elements: !360)
!360 = !{!361, !362, !363, !364}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !359, file: !356, line: 61, baseType: !88, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !359, file: !356, line: 64, baseType: !88, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !359, file: !356, line: 68, baseType: !93, size: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !359, file: !356, line: 70, baseType: !358, size: 64, offset: 192)
!365 = !{!366, !353}
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "address", scope: !368, file: !356, line: 421, type: !88, isLocal: true, isDefinition: true)
!368 = distinct !DISubprogram(name: "ftp_getaddress", scope: !356, file: !356, line: 419, type: !369, scopeLine: 420, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !355, retainedNodes: !104)
!369 = !DISubroutineType(types: !370)
!370 = !{!88}
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "global_state", scope: !373, file: !374, line: 43, type: !427, isLocal: true, isDefinition: true)
!373 = distinct !DICompileUnit(language: DW_LANG_C99, file: !374, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !375, retainedTypes: !376, globals: !381, nameTableKind: None)
!374 = !DIFile(filename: "html.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!375 = !{!5, !194, !138}
!376 = !{!70, !88, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !379, line: 31, baseType: !380)
!379 = !DIFile(filename: "/usr/include/sys/_types/_time_t.h", directory: "")
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !72, line: 120, baseType: !176)
!381 = !{!382, !394, !371}
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "html_allow", scope: !384, file: !374, line: 78, type: !387, isLocal: true, isDefinition: true)
!384 = distinct !DISubprogram(name: "htmlfindurl", scope: !374, file: !374, line: 72, type: !385, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !373, retainedNodes: !104)
!385 = !DISubroutineType(types: !386)
!386 = !{!166, !166, !93, !92, !93}
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 2816, elements: !392)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tag_attr", file: !374, line: 45, size: 128, elements: !389)
!389 = !{!390, !391}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !388, file: !374, line: 46, baseType: !88, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !388, file: !374, line: 47, baseType: !88, size: 64, offset: 64)
!392 = !{!393}
!393 = !DISubrange(count: 22)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "months", scope: !396, file: !374, line: 449, type: !426, isLocal: true, isDefinition: true)
!396 = distinct !DISubprogram(name: "ftp_index", scope: !374, file: !374, line: 406, type: !397, scopeLine: 407, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !373, retainedNodes: !104)
!397 = !DISubroutineType(types: !398)
!398 = !{!102, !166, !399, !415}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "urlinfo", file: !239, line: 28, size: 768, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !400, file: !239, line: 30, baseType: !88, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !400, file: !239, line: 31, baseType: !102, size: 32, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !400, file: !239, line: 32, baseType: !88, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !400, file: !239, line: 33, baseType: !73, size: 16, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_type", scope: !400, file: !239, line: 34, baseType: !85, size: 8, offset: 208)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !400, file: !239, line: 35, baseType: !88, size: 64, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !400, file: !239, line: 35, baseType: !88, size: 64, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !400, file: !239, line: 35, baseType: !88, size: 64, offset: 384)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !400, file: !239, line: 37, baseType: !88, size: 64, offset: 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "passwd", scope: !400, file: !239, line: 37, baseType: !88, size: 64, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !400, file: !239, line: 38, baseType: !399, size: 64, offset: 576)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !400, file: !239, line: 40, baseType: !88, size: 64, offset: 640)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !400, file: !239, line: 42, baseType: !88, size: 64, offset: 704)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fileinfo", file: !191, line: 53, size: 512, elements: !417)
!417 = !{!418, !419, !420, !421, !422, !423, !424, !425}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !416, file: !191, line: 55, baseType: !194, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !416, file: !191, line: 56, baseType: !88, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !416, file: !191, line: 57, baseType: !176, size: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !416, file: !191, line: 58, baseType: !176, size: 64, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !416, file: !191, line: 59, baseType: !93, size: 32, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "linkto", scope: !416, file: !191, line: 60, baseType: !88, size: 64, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !416, file: !191, line: 61, baseType: !415, size: 64, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !416, file: !191, line: 62, baseType: !415, size: 64, offset: 448)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 768, elements: !212)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "state_t", file: !428, line: 30, baseType: !429)
!428 = !DIFile(filename: "./html.h", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !428, line: 24, size: 320, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "at_value", scope: !429, file: !428, line: 26, baseType: !93, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "in_quote", scope: !429, file: !428, line: 26, baseType: !93, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "quote_char", scope: !429, file: !428, line: 27, baseType: !85, size: 8, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !429, file: !428, line: 28, baseType: !88, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !429, file: !428, line: 28, baseType: !88, size: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !429, file: !428, line: 29, baseType: !88, size: 64, offset: 256)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "first_retrieval", scope: !439, file: !440, line: 840, type: !93, isLocal: true, isDefinition: true)
!439 = distinct !DISubprogram(name: "http_loop", scope: !440, file: !440, line: 838, type: !441, scopeLine: 839, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !459, retainedNodes: !104)
!440 = !DIFile(filename: "http.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!441 = !DISubroutineType(types: !442)
!442 = !{!102, !443, !328, !92}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "urlinfo", file: !239, line: 28, size: 768, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !444, file: !239, line: 30, baseType: !88, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !444, file: !239, line: 31, baseType: !102, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !444, file: !239, line: 32, baseType: !88, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !444, file: !239, line: 33, baseType: !73, size: 16, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_type", scope: !444, file: !239, line: 34, baseType: !85, size: 8, offset: 208)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !444, file: !239, line: 35, baseType: !88, size: 64, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !444, file: !239, line: 35, baseType: !88, size: 64, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !444, file: !239, line: 35, baseType: !88, size: 64, offset: 384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !444, file: !239, line: 37, baseType: !88, size: 64, offset: 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "passwd", scope: !444, file: !239, line: 37, baseType: !88, size: 64, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !444, file: !239, line: 38, baseType: !443, size: 64, offset: 576)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !444, file: !239, line: 40, baseType: !88, size: 64, offset: 640)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !444, file: !239, line: 42, baseType: !88, size: 64, offset: 704)
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !440, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !460, retainedTypes: !471, globals: !478, nameTableKind: None)
!460 = !{!5, !138, !292, !461, !466}
!461 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "header_get_flags", file: !462, line: 24, baseType: !7, size: 32, elements: !463)
!462 = !DIFile(filename: "./headers.h", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!463 = !{!464, !465}
!464 = !DIEnumerator(name: "HG_NONE", value: 0, isUnsigned: true)
!465 = !DIEnumerator(name: "HG_NO_CONTINUATIONS", value: 2, isUnsigned: true)
!466 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !462, line: 20, baseType: !7, size: 32, elements: !467)
!467 = !{!468, !469, !470}
!468 = !DIEnumerator(name: "HG_OK", value: 0, isUnsigned: true)
!469 = !DIEnumerator(name: "HG_ERROR", value: 1, isUnsigned: true)
!470 = !DIEnumerator(name: "HG_EOF", value: 2, isUnsigned: true)
!471 = !{!311, !378, !88, !312, !69, !70, !328, !92, !472}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "http_process_range_closure", file: !440, line: 177, size: 192, elements: !474)
!474 = !{!475, !476, !477}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "first_byte_pos", scope: !473, file: !440, line: 178, baseType: !176, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "last_byte_pos", scope: !473, file: !440, line: 179, baseType: !176, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "entity_length", scope: !473, file: !440, line: 180, baseType: !176, size: 64, offset: 128)
!478 = !{!437, !479, !484, !486, !488, !497}
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "realm", scope: !481, file: !440, line: 1431, type: !88, isLocal: true, isDefinition: true)
!481 = distinct !DISubprogram(name: "digest_authentication_encode", scope: !440, file: !440, line: 1427, type: !482, scopeLine: 1430, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !459, retainedNodes: !104)
!482 = !DISubroutineType(types: !483)
!483 = !{!88, !166, !166, !166, !166, !166}
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "opaque", scope: !481, file: !440, line: 1431, type: !88, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "nonce", scope: !481, file: !440, line: 1431, type: !88, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "options", scope: !481, file: !440, line: 1435, type: !490, isLocal: true, isDefinition: true)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 384, elements: !495)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !481, file: !440, line: 1432, size: 128, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !491, file: !440, line: 1433, baseType: !166, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "variable", scope: !491, file: !440, line: 1434, baseType: !328, size: 64, offset: 64)
!495 = !{!496}
!496 = !DISubrange(count: 3)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "tbl", scope: !499, file: !440, line: 1310, type: !502, isLocal: true, isDefinition: true)
!499 = distinct !DISubprogram(name: "base64_encode", scope: !440, file: !440, line: 1307, type: !500, scopeLine: 1308, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !459, retainedNodes: !104)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !166, !88, !93}
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 512, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 64)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "commands", scope: !507, file: !508, line: 82, type: !513, isLocal: true, isDefinition: true)
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !104, retainedTypes: !509, globals: !512, nameTableKind: None)
!508 = !DIFile(filename: "init.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!509 = !{!70, !88, !510, !92, !328, !511, !176}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!512 = !{!505}
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 13056, elements: !522)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !508, line: 78, size: 192, elements: !515)
!515 = !{!516, !517, !518}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !514, file: !508, line: 79, baseType: !88, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !514, file: !508, line: 80, baseType: !311, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !514, file: !508, line: 81, baseType: !519, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!93, !166, !166, !311}
!522 = !{!523}
!523 = !DISubrange(count: 68)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "save_log_p", scope: !526, file: !527, line: 64, type: !93, isLocal: false, isDefinition: true)
!526 = distinct !DICompileUnit(language: DW_LANG_C99, file: !527, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !528, retainedTypes: !370, globals: !529, nameTableKind: None)
!527 = !DIFile(filename: "log.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!528 = !{!138}
!529 = !{!530, !532, !534, !524, !536}
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "saved_log", scope: !526, file: !527, line: 57, type: !88, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "saved_log_size", scope: !526, file: !527, line: 59, type: !176, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "saved_log_offset", scope: !526, file: !527, line: 62, type: !176, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "logfp", scope: !526, file: !527, line: 66, type: !538, isLocal: true, isDefinition: true)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !540, line: 157, baseType: !541)
!540 = !DIFile(filename: "/usr/include/_stdio.h", directory: "")
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !540, line: 126, size: 1216, elements: !542)
!542 = !{!543, !544, !545, !546, !548, !549, !554, !555, !556, !560, !564, !573, !577, !578, !581, !582, !584, !588, !589, !590}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !541, file: !540, line: 127, baseType: !69, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !541, file: !540, line: 128, baseType: !93, size: 32, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !541, file: !540, line: 129, baseType: !93, size: 32, offset: 96)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !541, file: !540, line: 130, baseType: !547, size: 16, offset: 128)
!547 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !541, file: !540, line: 131, baseType: !547, size: 16, offset: 144)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !541, file: !540, line: 132, baseType: !550, size: 128, offset: 192)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !540, line: 92, size: 128, elements: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !550, file: !540, line: 93, baseType: !69, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !550, file: !540, line: 94, baseType: !93, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !541, file: !540, line: 133, baseType: !93, size: 32, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !541, file: !540, line: 136, baseType: !311, size: 64, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !541, file: !540, line: 137, baseType: !557, size: 64, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!93, !311}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !541, file: !540, line: 138, baseType: !561, size: 64, offset: 512)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!93, !311, !88, !93}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !541, file: !540, line: 139, baseType: !565, size: 64, offset: 576)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!568, !311, !568, !93}
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !540, line: 81, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !570, line: 71, baseType: !571)
!570 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "")
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !72, line: 46, baseType: !572)
!572 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !541, file: !540, line: 140, baseType: !574, size: 64, offset: 640)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!93, !311, !166, !93}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !541, file: !540, line: 143, baseType: !550, size: 128, offset: 704)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !541, file: !540, line: 144, baseType: !579, size: 64, offset: 832)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !540, line: 98, flags: DIFlagFwdDecl)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !541, file: !540, line: 145, baseType: !93, size: 32, offset: 896)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !541, file: !540, line: 148, baseType: !583, size: 24, offset: 928)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 24, elements: !495)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !541, file: !540, line: 149, baseType: !585, size: 8, offset: 952)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 8, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 1)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !541, file: !540, line: 152, baseType: !550, size: 128, offset: 960)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !541, file: !540, line: 155, baseType: !93, size: 32, offset: 1088)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !541, file: !540, line: 156, baseType: !568, size: 64, offset: 1152)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "exec_name", scope: !593, file: !594, line: 72, type: !166, isLocal: false, isDefinition: true)
!593 = distinct !DICompileUnit(language: DW_LANG_C99, file: !594, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !595, retainedTypes: !596, globals: !600, nameTableKind: None)
!594 = !DIFile(filename: "main.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!595 = !{!5, !292, !138}
!596 = !{!92, !328, !88, !311, !597}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !93}
!600 = !{!601, !617, !591}
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "long_options", scope: !603, file: !594, line: 200, type: !608, isLocal: true, isDefinition: true)
!603 = distinct !DISubprogram(name: "main", scope: !594, file: !594, line: 195, type: !604, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !593, retainedNodes: !104)
!604 = !DISubroutineType(types: !605)
!605 = !{!93, !93, !606}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 16896, elements: !615)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !332, line: 77, size: 256, elements: !610)
!610 = !{!611, !612, !613, !614}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !609, file: !332, line: 80, baseType: !166, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !609, file: !332, line: 86, baseType: !93, size: 32, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !609, file: !332, line: 87, baseType: !92, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !609, file: !332, line: 88, baseType: !93, size: 32, offset: 192)
!615 = !{!616}
!616 = !DISubrange(count: 66)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(name: "opt", scope: !593, file: !594, line: 63, type: !619, isLocal: false, isDefinition: true)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "options", file: !620, line: 23, size: 3328, elements: !621)
!620 = !DIFile(filename: "./options.h", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!621 = !{!622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !619, file: !620, line: 25, baseType: !93, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !619, file: !620, line: 26, baseType: !93, size: 32, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ntry", scope: !619, file: !620, line: 27, baseType: !93, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !619, file: !620, line: 28, baseType: !93, size: 32, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "kill_longer", scope: !619, file: !620, line: 29, baseType: !93, size: 32, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_length", scope: !619, file: !620, line: 32, baseType: !93, size: 32, offset: 160)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !619, file: !620, line: 33, baseType: !93, size: 32, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "spanhost", scope: !619, file: !620, line: 34, baseType: !93, size: 32, offset: 224)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "relative_only", scope: !619, file: !620, line: 36, baseType: !93, size: 32, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "no_parent", scope: !619, file: !620, line: 37, baseType: !93, size: 32, offset: 288)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "simple_check", scope: !619, file: !620, line: 39, baseType: !93, size: 32, offset: 320)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "reclevel", scope: !619, file: !620, line: 42, baseType: !93, size: 32, offset: 352)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "dirstruct", scope: !619, file: !620, line: 43, baseType: !93, size: 32, offset: 384)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "no_dirstruct", scope: !619, file: !620, line: 45, baseType: !93, size: 32, offset: 416)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "cut_dirs", scope: !619, file: !620, line: 46, baseType: !93, size: 32, offset: 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "add_hostdir", scope: !619, file: !620, line: 47, baseType: !93, size: 32, offset: 480)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "noclobber", scope: !619, file: !620, line: 48, baseType: !93, size: 32, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "dir_prefix", scope: !619, file: !620, line: 50, baseType: !88, size: 64, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "lfilename", scope: !619, file: !620, line: 51, baseType: !88, size: 64, offset: 640)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "no_flush", scope: !619, file: !620, line: 52, baseType: !93, size: 32, offset: 704)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "input_filename", scope: !619, file: !620, line: 53, baseType: !88, size: 64, offset: 768)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "force_html", scope: !619, file: !620, line: 54, baseType: !93, size: 32, offset: 832)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "spider", scope: !619, file: !620, line: 56, baseType: !93, size: 32, offset: 864)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "accepts", scope: !619, file: !620, line: 58, baseType: !328, size: 64, offset: 896)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rejects", scope: !619, file: !620, line: 59, baseType: !328, size: 64, offset: 960)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "excludes", scope: !619, file: !620, line: 60, baseType: !328, size: 64, offset: 1024)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "includes", scope: !619, file: !620, line: 61, baseType: !328, size: 64, offset: 1088)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "domains", scope: !619, file: !620, line: 64, baseType: !328, size: 64, offset: 1152)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_domains", scope: !619, file: !620, line: 65, baseType: !328, size: 64, offset: 1216)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "follow_ftp", scope: !619, file: !620, line: 67, baseType: !93, size: 32, offset: 1280)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "retr_symlinks", scope: !619, file: !620, line: 69, baseType: !93, size: 32, offset: 1312)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "output_document", scope: !619, file: !620, line: 71, baseType: !88, size: 64, offset: 1344)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "dfp", scope: !619, file: !620, line: 73, baseType: !655, size: 64, offset: 1408)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !540, line: 157, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !540, line: 126, size: 1216, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !657, file: !540, line: 127, baseType: !69, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !657, file: !540, line: 128, baseType: !93, size: 32, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !657, file: !540, line: 129, baseType: !93, size: 32, offset: 96)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !657, file: !540, line: 130, baseType: !547, size: 16, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !657, file: !540, line: 131, baseType: !547, size: 16, offset: 144)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !657, file: !540, line: 132, baseType: !665, size: 128, offset: 192)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !540, line: 92, size: 128, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !665, file: !540, line: 93, baseType: !69, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !665, file: !540, line: 94, baseType: !93, size: 32, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !657, file: !540, line: 133, baseType: !93, size: 32, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !657, file: !540, line: 136, baseType: !311, size: 64, offset: 384)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !657, file: !540, line: 137, baseType: !557, size: 64, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !657, file: !540, line: 138, baseType: !561, size: 64, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !657, file: !540, line: 139, baseType: !565, size: 64, offset: 576)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !657, file: !540, line: 140, baseType: !574, size: 64, offset: 640)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !657, file: !540, line: 143, baseType: !665, size: 128, offset: 704)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !657, file: !540, line: 144, baseType: !579, size: 64, offset: 832)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !657, file: !540, line: 145, baseType: !93, size: 32, offset: 896)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !657, file: !540, line: 148, baseType: !583, size: 24, offset: 928)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !657, file: !540, line: 149, baseType: !585, size: 8, offset: 952)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !657, file: !540, line: 152, baseType: !665, size: 128, offset: 960)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !657, file: !540, line: 155, baseType: !93, size: 32, offset: 1088)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !657, file: !540, line: 156, baseType: !568, size: 64, offset: 1152)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "always_rest", scope: !619, file: !620, line: 76, baseType: !93, size: 32, offset: 1472)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_acc", scope: !619, file: !620, line: 77, baseType: !88, size: 64, offset: 1536)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_pass", scope: !619, file: !620, line: 78, baseType: !88, size: 64, offset: 1600)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "netrc", scope: !619, file: !620, line: 79, baseType: !93, size: 32, offset: 1664)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_glob", scope: !619, file: !620, line: 80, baseType: !93, size: 32, offset: 1696)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_pasv", scope: !619, file: !620, line: 81, baseType: !93, size: 32, offset: 1728)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "http_user", scope: !619, file: !620, line: 83, baseType: !88, size: 64, offset: 1792)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "http_passwd", scope: !619, file: !620, line: 84, baseType: !88, size: 64, offset: 1856)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "user_header", scope: !619, file: !620, line: 85, baseType: !88, size: 64, offset: 1920)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "use_proxy", scope: !619, file: !620, line: 87, baseType: !93, size: 32, offset: 1984)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_cache", scope: !619, file: !620, line: 88, baseType: !93, size: 32, offset: 2016)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "http_proxy", scope: !619, file: !620, line: 89, baseType: !88, size: 64, offset: 2048)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_proxy", scope: !619, file: !620, line: 89, baseType: !88, size: 64, offset: 2112)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "no_proxy", scope: !619, file: !620, line: 90, baseType: !328, size: 64, offset: 2176)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "base_href", scope: !619, file: !620, line: 91, baseType: !88, size: 64, offset: 2240)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_user", scope: !619, file: !620, line: 92, baseType: !88, size: 64, offset: 2304)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_passwd", scope: !619, file: !620, line: 93, baseType: !88, size: 64, offset: 2368)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !619, file: !620, line: 95, baseType: !176, size: 64, offset: 2432)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !619, file: !620, line: 98, baseType: !176, size: 64, offset: 2496)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "use_robots", scope: !619, file: !620, line: 99, baseType: !93, size: 32, offset: 2560)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "quota", scope: !619, file: !620, line: 101, baseType: !176, size: 64, offset: 2624)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "downloaded", scope: !619, file: !620, line: 103, baseType: !176, size: 64, offset: 2688)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "numurls", scope: !619, file: !620, line: 104, baseType: !93, size: 32, offset: 2752)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "server_response", scope: !619, file: !620, line: 107, baseType: !93, size: 32, offset: 2784)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "save_headers", scope: !619, file: !620, line: 108, baseType: !93, size: 32, offset: 2816)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !619, file: !620, line: 112, baseType: !93, size: 32, offset: 2848)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "timestamping", scope: !619, file: !620, line: 115, baseType: !93, size: 32, offset: 2880)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "backups", scope: !619, file: !620, line: 116, baseType: !93, size: 32, offset: 2912)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "useragent", scope: !619, file: !620, line: 118, baseType: !88, size: 64, offset: 2944)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "convert_links", scope: !619, file: !620, line: 121, baseType: !93, size: 32, offset: 3008)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "remove_listing", scope: !619, file: !620, line: 123, baseType: !93, size: 32, offset: 3040)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "htmlify", scope: !619, file: !620, line: 125, baseType: !93, size: 32, offset: 3072)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "dot_bytes", scope: !619, file: !620, line: 128, baseType: !176, size: 64, offset: 3136)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "dots_in_line", scope: !619, file: !620, line: 130, baseType: !93, size: 32, offset: 3200)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "dot_spacing", scope: !619, file: !620, line: 131, baseType: !93, size: 32, offset: 3232)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "delete_after", scope: !619, file: !620, line: 133, baseType: !93, size: 32, offset: 3264)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "fillbuf", scope: !721, file: !722, line: 61, type: !728, isLocal: true, isDefinition: true)
!721 = distinct !DICompileUnit(language: DW_LANG_C99, file: !722, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !104, retainedTypes: !723, globals: !727, nameTableKind: None)
!722 = !DIFile(filename: "md5.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!723 = !{!724, !166}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "md5_uint32", file: !726, line: 57, baseType: !7)
!726 = !DIFile(filename: "./md5.h", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!727 = !{!719}
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 512, elements: !503)
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "netrc_list", scope: !732, file: !733, line: 49, type: !739, isLocal: false, isDefinition: true)
!732 = distinct !DICompileUnit(language: DW_LANG_C99, file: !733, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !734, retainedTypes: !756, globals: !757, nameTableKind: None)
!733 = !DIFile(filename: "netrc.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!734 = !{!735}
!735 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !736, file: !733, line: 240, baseType: !7, size: 32, elements: !749)
!736 = distinct !DISubprogram(name: "parse_netrc", scope: !733, file: !733, line: 232, type: !737, scopeLine: 233, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !732, retainedNodes: !104)
!737 = !DISubroutineType(types: !738)
!738 = !{!739, !166}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "acc_t", file: !741, line: 27, baseType: !742)
!741 = !DIFile(filename: "./netrc.h", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_acc_t", file: !741, line: 20, size: 256, elements: !743)
!743 = !{!744, !745, !746, !747}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !742, file: !741, line: 22, baseType: !88, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !742, file: !741, line: 24, baseType: !88, size: 64, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "passwd", scope: !742, file: !741, line: 25, baseType: !88, size: 64, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !742, file: !741, line: 26, baseType: !748, size: 64, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!749 = !{!750, !751, !752, !753, !754, !755}
!750 = !DIEnumerator(name: "tok_nothing", value: 0, isUnsigned: true)
!751 = !DIEnumerator(name: "tok_account", value: 1, isUnsigned: true)
!752 = !DIEnumerator(name: "tok_login", value: 2, isUnsigned: true)
!753 = !DIEnumerator(name: "tok_macdef", value: 3, isUnsigned: true)
!754 = !DIEnumerator(name: "tok_machine", value: 4, isUnsigned: true)
!755 = !DIEnumerator(name: "tok_password", value: 5, isUnsigned: true)
!756 = !{!88, !70, !739}
!757 = !{!758, !730}
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "processed_netrc", scope: !760, file: !733, line: 64, type: !93, isLocal: true, isDefinition: true)
!760 = distinct !DISubprogram(name: "search_netrc", scope: !733, file: !733, line: 60, type: !761, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !732, retainedNodes: !104)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !166, !312, !312, !93}
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "ulist", scope: !765, file: !766, line: 59, type: !794, isLocal: true, isDefinition: true)
!765 = distinct !DICompileUnit(language: DW_LANG_C99, file: !766, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !767, retainedTypes: !777, globals: !778, nameTableKind: None)
!766 = !DIFile(filename: "recur.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!767 = !{!5, !768, !774, !306, !292, !138}
!768 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uflags", file: !239, line: 46, baseType: !7, size: 32, elements: !769)
!769 = !{!770, !771, !772, !773}
!770 = !DIEnumerator(name: "URELATIVE", value: 1, isUnsigned: true)
!771 = !DIEnumerator(name: "UNOPROTO", value: 2, isUnsigned: true)
!772 = !DIEnumerator(name: "UABS2REL", value: 4, isUnsigned: true)
!773 = !DIEnumerator(name: "UREL2ABS", value: 8, isUnsigned: true)
!774 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !307, line: 24, baseType: !7, size: 32, elements: !775)
!775 = !{!776}
!776 = !DIEnumerator(name: "NOSORT", value: 1, isUnsigned: true)
!777 = !{!311, !88, !70, !328}
!778 = !{!779, !792, !763, !801, !803, !805, !807, !809}
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "urls_downloaded", scope: !765, file: !766, line: 53, type: !781, isLocal: true, isDefinition: true)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "urlpos", file: !239, line: 63, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_urlpos", file: !239, line: 56, size: 320, elements: !784)
!784 = !{!785, !786, !787, !788, !789, !790}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !783, file: !239, line: 58, baseType: !88, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "local_name", scope: !783, file: !239, line: 59, baseType: !88, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !783, file: !239, line: 60, baseType: !768, size: 32, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !783, file: !239, line: 61, baseType: !93, size: 32, offset: 160)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !783, file: !239, line: 61, baseType: !93, size: 32, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !783, file: !239, line: 62, baseType: !791, size: 64, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "urls_html", scope: !765, file: !766, line: 56, type: !794, isLocal: true, isDefinition: true)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "slist", file: !307, line: 37, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !307, line: 33, size: 128, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !796, file: !307, line: 35, baseType: !88, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !796, file: !307, line: 36, baseType: !800, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "depth", scope: !765, file: !766, line: 65, type: !93, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "base_dir", scope: !765, file: !766, line: 68, type: !88, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "robots_host", scope: !765, file: !766, line: 71, type: !88, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "forbidden", scope: !765, file: !766, line: 62, type: !328, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "first_time", scope: !765, file: !766, line: 73, type: !93, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "c", scope: !813, file: !814, line: 85, type: !886, isLocal: true, isDefinition: true)
!813 = distinct !DISubprogram(name: "get_contents", scope: !814, file: !814, line: 81, type: !815, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !853, retainedNodes: !104)
!814 = !DIFile(filename: "retr.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!815 = !DISubroutineType(types: !816)
!816 = !{!93, !93, !817, !511, !176, !176, !845}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !540, line: 157, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !540, line: 126, size: 1216, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !819, file: !540, line: 127, baseType: !69, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !819, file: !540, line: 128, baseType: !93, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !819, file: !540, line: 129, baseType: !93, size: 32, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !819, file: !540, line: 130, baseType: !547, size: 16, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !819, file: !540, line: 131, baseType: !547, size: 16, offset: 144)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !819, file: !540, line: 132, baseType: !827, size: 128, offset: 192)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !540, line: 92, size: 128, elements: !828)
!828 = !{!829, !830}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !827, file: !540, line: 93, baseType: !69, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !827, file: !540, line: 94, baseType: !93, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !819, file: !540, line: 133, baseType: !93, size: 32, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !819, file: !540, line: 136, baseType: !311, size: 64, offset: 384)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !819, file: !540, line: 137, baseType: !557, size: 64, offset: 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !819, file: !540, line: 138, baseType: !561, size: 64, offset: 512)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !819, file: !540, line: 139, baseType: !565, size: 64, offset: 576)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !819, file: !540, line: 140, baseType: !574, size: 64, offset: 640)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !819, file: !540, line: 143, baseType: !827, size: 128, offset: 704)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !819, file: !540, line: 144, baseType: !579, size: 64, offset: 832)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !819, file: !540, line: 145, baseType: !93, size: 32, offset: 896)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !819, file: !540, line: 148, baseType: !583, size: 24, offset: 928)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !819, file: !540, line: 149, baseType: !585, size: 8, offset: 952)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !819, file: !540, line: 152, baseType: !827, size: 128, offset: 960)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !819, file: !540, line: 155, baseType: !93, size: 32, offset: 1088)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !819, file: !540, line: 156, baseType: !568, size: 64, offset: 1152)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbuf", file: !153, line: 24, size: 33024, elements: !847)
!847 = !{!848, !849, !850, !851, !852}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !846, file: !153, line: 26, baseType: !93, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !846, file: !153, line: 27, baseType: !157, size: 32768, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pos", scope: !846, file: !153, line: 28, baseType: !88, size: 64, offset: 32832)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_left", scope: !846, file: !153, line: 29, baseType: !162, size: 64, offset: 32896)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "internal_dont_touch_this", scope: !846, file: !153, line: 31, baseType: !93, size: 32, offset: 32960)
!853 = distinct !DICompileUnit(language: DW_LANG_C99, file: !814, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !854, retainedTypes: !860, globals: !862, nameTableKind: None)
!854 = !{!855, !5, !138, !292, !768}
!855 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "spflags", file: !814, line: 55, baseType: !7, size: 32, elements: !856)
!856 = !{!857, !858, !859}
!857 = !DIEnumerator(name: "SP_NONE", value: 0, isUnsigned: true)
!858 = !DIEnumerator(name: "SP_INIT", value: 1, isUnsigned: true)
!859 = !DIEnumerator(name: "SP_FINISH", value: 2, isUnsigned: true)
!860 = !{!311, !861, !312, !88, !176, !93}
!861 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!862 = !{!811, !863, !871, !873, !875, !880, !882, !884}
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "res", scope: !865, file: !814, line: 264, type: !868, isLocal: true, isDefinition: true)
!865 = distinct !DISubprogram(name: "rate", scope: !814, file: !814, line: 262, type: !866, scopeLine: 263, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !853, retainedNodes: !104)
!866 = !DISubroutineType(types: !867)
!867 = !{!88, !176, !176}
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 120, elements: !869)
!869 = !{!870}
!870 = !DISubrange(count: 15)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(name: "internal_secs", scope: !853, file: !814, line: 47, type: !176, isLocal: true, isDefinition: true)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "internal_msecs", scope: !853, file: !814, line: 47, type: !176, isLocal: true, isDefinition: true)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(name: "line_bytes", scope: !877, file: !814, line: 148, type: !176, isLocal: true, isDefinition: true)
!877 = distinct !DISubprogram(name: "show_progress", scope: !814, file: !814, line: 146, type: !878, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !853, retainedNodes: !104)
!878 = !DISubroutineType(types: !879)
!879 = !{!93, !176, !176, !855}
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "offs", scope: !877, file: !814, line: 149, type: !176, isLocal: true, isDefinition: true)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "ndot", scope: !877, file: !814, line: 150, type: !93, isLocal: true, isDefinition: true)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "nrow", scope: !877, file: !814, line: 150, type: !93, isLocal: true, isDefinition: true)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 65536, elements: !887)
!887 = !{!888}
!888 = !DISubrange(count: 8192)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "sup_protos", scope: !891, file: !892, line: 135, type: !928, isLocal: true, isDefinition: true)
!891 = distinct !DICompileUnit(language: DW_LANG_C99, file: !892, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !893, retainedTypes: !894, globals: !922, nameTableKind: None)
!892 = !DIFile(filename: "url.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!893 = !{!5, !768, !138}
!894 = !{!70, !88, !895, !311, !176, !911}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "urlinfo", file: !239, line: 28, size: 768, elements: !897)
!897 = !{!898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !896, file: !239, line: 30, baseType: !88, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !896, file: !239, line: 31, baseType: !102, size: 32, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !896, file: !239, line: 32, baseType: !88, size: 64, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !896, file: !239, line: 33, baseType: !73, size: 16, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_type", scope: !896, file: !239, line: 34, baseType: !85, size: 8, offset: 208)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !896, file: !239, line: 35, baseType: !88, size: 64, offset: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !896, file: !239, line: 35, baseType: !88, size: 64, offset: 320)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !896, file: !239, line: 35, baseType: !88, size: 64, offset: 384)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !896, file: !239, line: 37, baseType: !88, size: 64, offset: 448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "passwd", scope: !896, file: !239, line: 37, baseType: !88, size: 64, offset: 512)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !896, file: !239, line: 38, baseType: !895, size: 64, offset: 576)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !896, file: !239, line: 40, baseType: !88, size: 64, offset: 640)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !896, file: !239, line: 42, baseType: !88, size: 64, offset: 704)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "urlpos", file: !239, line: 63, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_urlpos", file: !239, line: 56, size: 320, elements: !914)
!914 = !{!915, !916, !917, !918, !919, !920}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !913, file: !239, line: 58, baseType: !88, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "local_name", scope: !913, file: !239, line: 59, baseType: !88, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !913, file: !239, line: 60, baseType: !768, size: 32, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !913, file: !239, line: 61, baseType: !93, size: 32, offset: 160)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !913, file: !239, line: 61, baseType: !93, size: 32, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !913, file: !239, line: 62, baseType: !921, size: 64, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!922 = !{!889, !923}
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "protostrings", scope: !891, file: !892, line: 92, type: !925, isLocal: true, isDefinition: true)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 1984, elements: !926)
!926 = !{!927}
!927 = !DISubrange(count: 31)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 256, elements: !169)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "proto", file: !892, line: 127, size: 128, elements: !930)
!930 = !{!931, !932, !933}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !929, file: !892, line: 129, baseType: !88, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ind", scope: !929, file: !892, line: 130, baseType: !102, size: 32, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !929, file: !892, line: 131, baseType: !73, size: 16, offset: 96)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(name: "tms", scope: !936, file: !937, line: 181, type: !868, isLocal: true, isDefinition: true)
!936 = distinct !DISubprogram(name: "time_str", scope: !937, file: !937, line: 179, type: !938, scopeLine: 180, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !940, retainedNodes: !104)
!937 = !DIFile(filename: "utils.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!938 = !DISubroutineType(types: !939)
!939 = !{!88, !377}
!940 = distinct !DICompileUnit(language: DW_LANG_C99, file: !937, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !941, retainedTypes: !942, globals: !952, nameTableKind: None)
!941 = !{!5, !138, !306, !774}
!942 = !{!88, !328, !70, !943, !945}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "slist", file: !307, line: 37, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !307, line: 33, size: 128, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !947, file: !307, line: 35, baseType: !88, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !947, file: !307, line: 36, baseType: !951, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!952 = !{!934, !953}
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(name: "outbuf", scope: !955, file: !937, line: 904, type: !177, isLocal: true, isDefinition: true)
!955 = distinct !DISubprogram(name: "legible", scope: !937, file: !937, line: 902, type: !956, scopeLine: 903, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !940, retainedNodes: !104)
!956 = !DISubroutineType(types: !957)
!957 = !{!88, !176}
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "version_string", scope: !960, file: !961, line: 1, type: !88, isLocal: false, isDefinition: true)
!960 = distinct !DICompileUnit(language: DW_LANG_C99, file: !961, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !104, globals: !962, nameTableKind: None)
!961 = !DIFile(filename: "version.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!962 = !{!958}
!963 = distinct !DICompileUnit(language: DW_LANG_C99, file: !964, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !104, nameTableKind: None)
!964 = !DIFile(filename: "cmpt.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!965 = distinct !DICompileUnit(language: DW_LANG_C99, file: !966, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !104, nameTableKind: None)
!966 = !DIFile(filename: "fnmatch.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!967 = distinct !DICompileUnit(language: DW_LANG_C99, file: !968, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !969, retainedTypes: !970, nameTableKind: None)
!968 = !DIFile(filename: "headers.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!969 = !{!461, !466}
!970 = !{!88, !70, !511, !328}
!971 = distinct !DICompileUnit(language: DW_LANG_C99, file: !972, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !104, nameTableKind: None)
!972 = !DIFile(filename: "rbuf.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/wget-1.5.3/src")
!973 = !{!"clang version 10.0.0 "}
!974 = !{i32 7, !"Dwarf Version", i32 4}
!975 = !{i32 2, !"Debug Info Version", i32 3}
!976 = !{i32 1, !"wchar_size", i32 4}
!977 = !{i32 7, !"PIC Level", i32 2}
!978 = distinct !DISubprogram(name: "make_connection", scope: !3, file: !3, line: 63, type: !979, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !104)
!979 = !DISubroutineType(types: !980)
!980 = !{!102, !92, !88, !73}
!981 = !DILocalVariable(name: "sock", arg: 1, scope: !978, file: !3, line: 63, type: !92)
!982 = !DILocation(line: 63, column: 23, scope: !978)
!983 = !DILocalVariable(name: "hostname", arg: 2, scope: !978, file: !3, line: 63, type: !88)
