; ModuleID = 'thttpd.bc'
source_filename = "llvm-link"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.15.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.throttletab = type { i8*, i64, i64, i64, i64, i32 }
%struct.httpd_server = type { i8*, i8*, i16, i8*, i32, i32, i8*, i8*, i32, i8*, i32, i32, i32, %struct.__sFILE*, i32, i32, i32, i8*, i8*, i32 }
%union.ClientData = type { i8* }
%struct.connecttab = type { i32, i32, %struct.httpd_conn*, [10 x i32], i32, i64, i64, i64, i64, %struct.TimerStruct*, %struct.TimerStruct*, i64, i64, i64, i64 }
%struct.httpd_conn = type { i32, %struct.httpd_server*, %union.httpd_sockaddr, i8*, i64, i64, i64, i32, i32, i32, i64, i64, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i8*, i8*, i32, i32, i32, i32, i64, i64, i32, i32, %struct.stat, i32, i8* }
%union.httpd_sockaddr = type { %struct.sockaddr_storage }
%struct.sockaddr_storage = type { i8, i8, [6 x i8], i64, [112 x i8] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "terminate", scope: !2, file: !3, line: 134, type: !26, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !412, nameTableKind: None)
!3 = !DIFile(filename: "thttpd.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/thttpd-2.29")
!4 = !{}
!5 = !{!6, !8, !27, !50, !26, !106, !109, !187, !211, !219, !243, !246, !248, !255, !70, !386, !392, !395, !24, !137, !396, !267}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "throttletab", file: !3, line: 99, baseType: !10)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 93, size: 384, elements: !11)
!11 = !{!12, !13, !15, !16, !17, !25}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !10, file: !3, line: 94, baseType: !6, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "max_limit", scope: !10, file: !3, line: 95, baseType: !14, size: 64, offset: 64)
!14 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "min_limit", scope: !10, file: !3, line: 95, baseType: !14, size: 64, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !10, file: !3, line: 96, baseType: !14, size: 64, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_since_avg", scope: !10, file: !3, line: 97, baseType: !18, size: 64, offset: 256)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !19, line: 31, baseType: !20)
!19 = !DIFile(filename: "/usr/include/sys/_types/_off_t.h", directory: "")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !21, line: 71, baseType: !22)
!21 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !23, line: 46, baseType: !24)
!23 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "")
!24 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "num_sending", scope: !10, file: !3, line: 98, baseType: !26, size: 32, offset: 320)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !29, line: 84, size: 576, elements: !30)
!29 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!30 = !{!31, !32, !33, !39, !43, !45, !46, !47, !48, !49}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !28, file: !29, line: 85, baseType: !6, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !28, file: !29, line: 86, baseType: !6, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !28, file: !29, line: 87, baseType: !34, size: 32, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !35, line: 31, baseType: !36)
!35 = !DIFile(filename: "/usr/include/sys/_types/_uid_t.h", directory: "")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !21, line: 75, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !23, line: 45, baseType: !38)
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !28, file: !29, line: 88, baseType: !40, size: 32, offset: 160)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !41, line: 31, baseType: !42)
!41 = !DIFile(filename: "/usr/include/sys/_types/_gid_t.h", directory: "")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !21, line: 60, baseType: !37)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "pw_change", scope: !28, file: !29, line: 89, baseType: !44, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !23, line: 120, baseType: !14)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "pw_class", scope: !28, file: !29, line: 90, baseType: !6, size: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !28, file: !29, line: 91, baseType: !6, size: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !28, file: !29, line: 92, baseType: !6, size: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !28, file: !29, line: 93, baseType: !6, size: 64, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "pw_expire", scope: !28, file: !29, line: 94, baseType: !44, size: 64, offset: 512)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !52, line: 157, baseType: !53)
!52 = !DIFile(filename: "/usr/include/_stdio.h", directory: "")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !52, line: 126, size: 1216, elements: !54)
!54 = !{!55, !58, !59, !60, !62, !63, !68, !69, !71, !75, !79, !84, !90, !91, !94, !95, !99, !103, !104, !105}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !53, file: !52, line: 127, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !53, file: !52, line: 128, baseType: !26, size: 32, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !53, file: !52, line: 129, baseType: !26, size: 32, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !53, file: !52, line: 130, baseType: !61, size: 16, offset: 128)
!61 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !53, file: !52, line: 131, baseType: !61, size: 16, offset: 144)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !53, file: !52, line: 132, baseType: !64, size: 128, offset: 192)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !52, line: 92, size: 128, elements: !65)
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !64, file: !52, line: 93, baseType: !56, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !64, file: !52, line: 94, baseType: !26, size: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !53, file: !52, line: 133, baseType: !26, size: 32, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !53, file: !52, line: 136, baseType: !70, size: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !53, file: !52, line: 137, baseType: !72, size: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!26, !70}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !53, file: !52, line: 138, baseType: !76, size: 64, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!26, !70, !6, !26}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !53, file: !52, line: 139, baseType: !80, size: 64, offset: 576)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !70, !83, !26}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !52, line: 81, baseType: !20)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !53, file: !52, line: 140, baseType: !85, size: 64, offset: 640)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!26, !70, !88, !26}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !53, file: !52, line: 143, baseType: !64, size: 128, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !53, file: !52, line: 144, baseType: !92, size: 64, offset: 832)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !52, line: 98, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !53, file: !52, line: 145, baseType: !26, size: 32, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !53, file: !52, line: 148, baseType: !96, size: 24, offset: 928)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 24, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 3)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !53, file: !52, line: 149, baseType: !100, size: 8, offset: 952)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 1)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !53, file: !52, line: 152, baseType: !64, size: 128, offset: 960)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !53, file: !52, line: 155, baseType: !26, size: 32, offset: 1088)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !53, file: !52, line: 156, baseType: !83, size: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !26}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "httpd_sockaddr", file: !111, line: 69, baseType: !112)
!111 = !DIFile(filename: "./libhttpd.h", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/thttpd-2.29")
!112 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !111, line: 62, size: 1024, elements: !113)
!113 = !{!114, !127, !148, !173}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !112, file: !111, line: 63, baseType: !115, size: 128)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !116, line: 407, size: 128, elements: !117)
!116 = !DIFile(filename: "/usr/include/sys/socket.h", directory: "")
!117 = !{!118, !120, !123}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "sa_len", scope: !115, file: !116, line: 408, baseType: !119, size: 8)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !23, line: 41, baseType: !57)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !115, file: !116, line: 409, baseType: !121, size: 8, offset: 8)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !122, line: 31, baseType: !119)
!122 = !DIFile(filename: "/usr/include/sys/_types/_sa_family_t.h", directory: "")
!123 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !115, file: !116, line: 410, baseType: !124, size: 112, offset: 16)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 112, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 14)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "sa_in", scope: !112, file: !111, line: 64, baseType: !128, size: 128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !129, line: 375, size: 128, elements: !130)
!129 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!130 = !{!131, !132, !133, !138, !144}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "sin_len", scope: !128, file: !129, line: 376, baseType: !119, size: 8)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !128, file: !129, line: 377, baseType: !121, size: 8, offset: 8)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !128, file: !129, line: 378, baseType: !134, size: 16, offset: 16)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !135, line: 31, baseType: !136)
!135 = !DIFile(filename: "/usr/include/sys/_types/_in_port_t.h", directory: "")
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !23, line: 43, baseType: !137)
!137 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !128, file: !129, line: 379, baseType: !139, size: 32, offset: 32)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !129, line: 301, size: 32, elements: !140)
!140 = !{!141}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !139, file: !129, line: 302, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !143, line: 31, baseType: !37)
!143 = !DIFile(filename: "/usr/include/sys/_types/_in_addr_t.h", directory: "")
!144 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !128, file: !129, line: 380, baseType: !145, size: 64, offset: 64)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 8)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "sa_in6", scope: !112, file: !111, line: 66, baseType: !149, size: 224)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !150, line: 169, size: 224, elements: !151)
!150 = !DIFile(filename: "/usr/include/netinet6/in6.h", directory: "")
!151 = !{!152, !153, !154, !155, !156, !172}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_len", scope: !149, file: !150, line: 170, baseType: !119, size: 8)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !149, file: !150, line: 171, baseType: !121, size: 8, offset: 8)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !149, file: !150, line: 172, baseType: !134, size: 16, offset: 16)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !149, file: !150, line: 173, baseType: !37, size: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !149, file: !150, line: 174, baseType: !157, size: 128, offset: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !150, line: 151, size: 128, elements: !158)
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr", scope: !157, file: !150, line: 156, baseType: !160, size: 128)
!160 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !157, file: !150, line: 152, size: 128, elements: !161)
!161 = !{!162, !166, !168}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !160, file: !150, line: 153, baseType: !163, size: 128)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 128, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 16)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !160, file: !150, line: 154, baseType: !167, size: 128)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 128, elements: !146)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !160, file: !150, line: 155, baseType: !169, size: 128)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 128, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 4)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !149, file: !150, line: 175, baseType: !37, size: 32, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "sa_stor", scope: !112, file: !111, line: 67, baseType: !174, size: 1024)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !116, line: 440, size: 1024, elements: !175)
!175 = !{!176, !177, !178, !182, !183}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ss_len", scope: !174, file: !116, line: 441, baseType: !119, size: 8)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !174, file: !116, line: 442, baseType: !121, size: 8, offset: 8)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_pad1", scope: !174, file: !116, line: 443, baseType: !179, size: 48, offset: 16)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 48, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 6)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !174, file: !116, line: 444, baseType: !22, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_pad2", scope: !174, file: !116, line: 445, baseType: !184, size: 896, offset: 128)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 896, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 112)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "httpd_server", file: !111, line: 91, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 72, size: 1088, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "binding_hostname", scope: !189, file: !111, line: 73, baseType: !6, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "server_hostname", scope: !189, file: !111, line: 74, baseType: !6, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !189, file: !111, line: 75, baseType: !137, size: 16, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cgi_pattern", scope: !189, file: !111, line: 76, baseType: !6, size: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cgi_limit", scope: !189, file: !111, line: 77, baseType: !26, size: 32, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cgi_count", scope: !189, file: !111, line: 77, baseType: !26, size: 32, offset: 288)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !189, file: !111, line: 78, baseType: !6, size: 64, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "p3p", scope: !189, file: !111, line: 79, baseType: !6, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "max_age", scope: !189, file: !111, line: 80, baseType: !26, size: 32, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "cwd", scope: !189, file: !111, line: 81, baseType: !6, size: 64, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "listen4_fd", scope: !189, file: !111, line: 82, baseType: !26, size: 32, offset: 576)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "listen6_fd", scope: !189, file: !111, line: 82, baseType: !26, size: 32, offset: 608)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "no_log", scope: !189, file: !111, line: 83, baseType: !26, size: 32, offset: 640)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "logfp", scope: !189, file: !111, line: 84, baseType: !50, size: 64, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "no_symlink_check", scope: !189, file: !111, line: 85, baseType: !26, size: 32, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "vhost", scope: !189, file: !111, line: 86, baseType: !26, size: 32, offset: 800)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "global_passwd", scope: !189, file: !111, line: 87, baseType: !26, size: 32, offset: 832)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "url_pattern", scope: !189, file: !111, line: 88, baseType: !6, size: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "local_pattern", scope: !189, file: !111, line: 89, baseType: !6, size: 64, offset: 960)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "no_empty_referrers", scope: !189, file: !111, line: 90, baseType: !26, size: 32, offset: 1024)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !213, line: 34, size: 128, elements: !214)
!213 = !DIFile(filename: "/usr/include/sys/_types/_timeval.h", directory: "")
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !212, file: !213, line: 36, baseType: !44, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !212, file: !213, line: 37, baseType: !217, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_suseconds_t", file: !21, line: 74, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !23, line: 44, baseType: !26)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !221, line: 65, baseType: !222)
!221 = !DIFile(filename: "./timers.h", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/thttpd-2.29")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TimerStruct", file: !221, line: 56, size: 576, elements: !223)
!223 = !{!224, !235, !236, !237, !238, !239, !241, !242}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "timer_proc", scope: !222, file: !221, line: 57, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerProc", file: !221, line: 53, baseType: !227)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !229, !211}
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClientData", file: !221, line: 45, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !221, line: 41, size: 64, elements: !231)
!231 = !{!232, !233, !234}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !230, file: !221, line: 42, baseType: !70, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !230, file: !221, line: 43, baseType: !26, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !230, file: !221, line: 44, baseType: !14, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !222, file: !221, line: 58, baseType: !229, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "msecs", scope: !222, file: !221, line: 59, baseType: !14, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !222, file: !221, line: 60, baseType: !26, size: 32, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !222, file: !221, line: 61, baseType: !212, size: 128, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !222, file: !221, line: 62, baseType: !240, size: 64, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !221, line: 63, baseType: !240, size: 64, offset: 448)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !222, file: !221, line: 64, baseType: !26, size: 32, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !245, line: 31, baseType: !44)
!245 = !DIFile(filename: "/usr/include/sys/_types/_time_t.h", directory: "")
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "connecttab", file: !3, line: 120, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 106, size: 1152, elements: !251)
!251 = !{!252, !253, !254, !371, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "conn_state", scope: !250, file: !3, line: 107, baseType: !26, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next_free_connect", scope: !250, file: !3, line: 108, baseType: !26, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "hc", scope: !250, file: !3, line: 109, baseType: !255, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "httpd_conn", file: !111, line: 148, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 94, size: 5760, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !369, !370}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !257, file: !111, line: 95, baseType: !26, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "hs", scope: !257, file: !111, line: 96, baseType: !187, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "client_addr", scope: !257, file: !111, line: 97, baseType: !110, size: 1024, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !257, file: !111, line: 98, baseType: !6, size: 64, offset: 1152)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "read_size", scope: !257, file: !111, line: 99, baseType: !264, size: 64, offset: 1216)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !265, line: 31, baseType: !266)
!265 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "")
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !23, line: 92, baseType: !267)
!267 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "read_idx", scope: !257, file: !111, line: 99, baseType: !264, size: 64, offset: 1280)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "checked_idx", scope: !257, file: !111, line: 99, baseType: !264, size: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "checked_state", scope: !257, file: !111, line: 100, baseType: !26, size: 32, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !257, file: !111, line: 101, baseType: !26, size: 32, offset: 1440)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !257, file: !111, line: 102, baseType: !26, size: 32, offset: 1472)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_to_send", scope: !257, file: !111, line: 103, baseType: !18, size: 64, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_sent", scope: !257, file: !111, line: 104, baseType: !18, size: 64, offset: 1600)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "encodedurl", scope: !257, file: !111, line: 105, baseType: !6, size: 64, offset: 1664)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "decodedurl", scope: !257, file: !111, line: 106, baseType: !6, size: 64, offset: 1728)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !257, file: !111, line: 107, baseType: !6, size: 64, offset: 1792)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "origfilename", scope: !257, file: !111, line: 108, baseType: !6, size: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "expnfilename", scope: !257, file: !111, line: 109, baseType: !6, size: 64, offset: 1920)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "encodings", scope: !257, file: !111, line: 110, baseType: !6, size: 64, offset: 1984)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pathinfo", scope: !257, file: !111, line: 111, baseType: !6, size: 64, offset: 2048)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !257, file: !111, line: 112, baseType: !6, size: 64, offset: 2112)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "referrer", scope: !257, file: !111, line: 113, baseType: !6, size: 64, offset: 2176)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "useragent", scope: !257, file: !111, line: 114, baseType: !6, size: 64, offset: 2240)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !257, file: !111, line: 115, baseType: !6, size: 64, offset: 2304)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "accepte", scope: !257, file: !111, line: 116, baseType: !6, size: 64, offset: 2368)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "acceptl", scope: !257, file: !111, line: 117, baseType: !6, size: 64, offset: 2432)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !257, file: !111, line: 118, baseType: !6, size: 64, offset: 2496)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !257, file: !111, line: 119, baseType: !6, size: 64, offset: 2560)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "reqhost", scope: !257, file: !111, line: 120, baseType: !6, size: 64, offset: 2624)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "hdrhost", scope: !257, file: !111, line: 121, baseType: !6, size: 64, offset: 2688)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "hostdir", scope: !257, file: !111, line: 122, baseType: !6, size: 64, offset: 2752)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "authorization", scope: !257, file: !111, line: 123, baseType: !6, size: 64, offset: 2816)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "remoteuser", scope: !257, file: !111, line: 124, baseType: !6, size: 64, offset: 2880)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !257, file: !111, line: 125, baseType: !6, size: 64, offset: 2944)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "maxdecodedurl", scope: !257, file: !111, line: 126, baseType: !264, size: 64, offset: 3008)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "maxorigfilename", scope: !257, file: !111, line: 126, baseType: !264, size: 64, offset: 3072)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "maxexpnfilename", scope: !257, file: !111, line: 126, baseType: !264, size: 64, offset: 3136)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "maxencodings", scope: !257, file: !111, line: 126, baseType: !264, size: 64, offset: 3200)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "maxpathinfo", scope: !257, file: !111, line: 127, baseType: !264, size: 64, offset: 3264)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "maxquery", scope: !257, file: !111, line: 127, baseType: !264, size: 64, offset: 3328)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "maxaccept", scope: !257, file: !111, line: 127, baseType: !264, size: 64, offset: 3392)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "maxaccepte", scope: !257, file: !111, line: 127, baseType: !264, size: 64, offset: 3456)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "maxreqhost", scope: !257, file: !111, line: 127, baseType: !264, size: 64, offset: 3520)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "maxhostdir", scope: !257, file: !111, line: 127, baseType: !264, size: 64, offset: 3584)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "maxremoteuser", scope: !257, file: !111, line: 128, baseType: !264, size: 64, offset: 3648)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "maxresponse", scope: !257, file: !111, line: 128, baseType: !264, size: 64, offset: 3712)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "responselen", scope: !257, file: !111, line: 133, baseType: !264, size: 64, offset: 3776)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "if_modified_since", scope: !257, file: !111, line: 134, baseType: !244, size: 64, offset: 3840)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "range_if", scope: !257, file: !111, line: 134, baseType: !244, size: 64, offset: 3904)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "contentlength", scope: !257, file: !111, line: 135, baseType: !264, size: 64, offset: 3968)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !257, file: !111, line: 136, baseType: !6, size: 64, offset: 4032)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !257, file: !111, line: 137, baseType: !6, size: 64, offset: 4096)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "mime_flag", scope: !257, file: !111, line: 138, baseType: !26, size: 32, offset: 4160)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "one_one", scope: !257, file: !111, line: 139, baseType: !26, size: 32, offset: 4192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "got_range", scope: !257, file: !111, line: 140, baseType: !26, size: 32, offset: 4224)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tildemapped", scope: !257, file: !111, line: 141, baseType: !26, size: 32, offset: 4256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "first_byte_index", scope: !257, file: !111, line: 142, baseType: !18, size: 64, offset: 4288)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "last_byte_index", scope: !257, file: !111, line: 142, baseType: !18, size: 64, offset: 4352)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !257, file: !111, line: 143, baseType: !26, size: 32, offset: 4416)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "should_linger", scope: !257, file: !111, line: 144, baseType: !26, size: 32, offset: 4448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sb", scope: !257, file: !111, line: 145, baseType: !323, size: 1152, offset: 4480)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !324, line: 182, size: 1152, elements: !325)
!324 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "")
!325 = !{!326, !330, !334, !337, !341, !342, !343, !344, !350, !351, !352, !353, !354, !358, !362, !363, !364, !365}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !323, file: !324, line: 182, baseType: !327, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !328, line: 31, baseType: !329)
!328 = !DIFile(filename: "/usr/include/sys/_types/_dev_t.h", directory: "")
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_dev_t", file: !21, line: 57, baseType: !218)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !323, file: !324, line: 182, baseType: !331, size: 16, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !332, line: 31, baseType: !333)
!332 = !DIFile(filename: "/usr/include/sys/_types/_mode_t.h", directory: "")
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !21, line: 70, baseType: !136)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !323, file: !324, line: 182, baseType: !335, size: 16, offset: 48)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !336, line: 31, baseType: !136)
!336 = !DIFile(filename: "/usr/include/sys/_types/_nlink_t.h", directory: "")
!337 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !323, file: !324, line: 182, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino64_t", file: !21, line: 62, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !23, line: 47, baseType: !340)
!340 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !323, file: !324, line: 182, baseType: !34, size: 32, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !323, file: !324, line: 182, baseType: !40, size: 32, offset: 160)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !323, file: !324, line: 182, baseType: !327, size: 32, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !323, file: !324, line: 182, baseType: !345, size: 128, offset: 256)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !346, line: 33, size: 128, elements: !347)
!346 = !DIFile(filename: "/usr/include/sys/_types/_timespec.h", directory: "")
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !345, file: !346, line: 35, baseType: !44, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !345, file: !346, line: 36, baseType: !14, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !323, file: !324, line: 182, baseType: !345, size: 128, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !323, file: !324, line: 182, baseType: !345, size: 128, offset: 512)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !323, file: !324, line: 182, baseType: !345, size: 128, offset: 640)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !323, file: !324, line: 182, baseType: !18, size: 64, offset: 768)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !323, file: !324, line: 182, baseType: !355, size: 64, offset: 832)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !356, line: 31, baseType: !357)
!356 = !DIFile(filename: "/usr/include/sys/_types/_blkcnt_t.h", directory: "")
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blkcnt_t", file: !21, line: 55, baseType: !22)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !323, file: !324, line: 182, baseType: !359, size: 32, offset: 896)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !360, line: 31, baseType: !361)
!360 = !DIFile(filename: "/usr/include/sys/_types/_blksize_t.h", directory: "")
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blksize_t", file: !21, line: 56, baseType: !218)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !323, file: !324, line: 182, baseType: !37, size: 32, offset: 928)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !323, file: !324, line: 182, baseType: !37, size: 32, offset: 960)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !323, file: !324, line: 182, baseType: !218, size: 32, offset: 992)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !323, file: !324, line: 182, baseType: !366, size: 128, offset: 1024)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 2)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "conn_fd", scope: !257, file: !111, line: 146, baseType: !26, size: 32, offset: 5632)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "file_address", scope: !257, file: !111, line: 147, baseType: !6, size: 64, offset: 5696)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tnums", scope: !250, file: !3, line: 110, baseType: !372, size: 320, offset: 128)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 320, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 10)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "numtnums", scope: !250, file: !3, line: 111, baseType: !26, size: 32, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "max_limit", scope: !250, file: !3, line: 112, baseType: !14, size: 64, offset: 512)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "min_limit", scope: !250, file: !3, line: 112, baseType: !14, size: 64, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "started_at", scope: !250, file: !3, line: 113, baseType: !244, size: 64, offset: 640)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "active_at", scope: !250, file: !3, line: 113, baseType: !244, size: 64, offset: 704)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_timer", scope: !250, file: !3, line: 114, baseType: !219, size: 64, offset: 768)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "linger_timer", scope: !250, file: !3, line: 115, baseType: !219, size: 64, offset: 832)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "wouldblock_delay", scope: !250, file: !3, line: 116, baseType: !14, size: 64, offset: 896)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !250, file: !3, line: 117, baseType: !18, size: 64, offset: 960)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "end_byte_index", scope: !250, file: !3, line: 118, baseType: !18, size: 64, offset: 1024)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "next_byte_index", scope: !250, file: !3, line: 119, baseType: !18, size: 64, offset: 1088)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timezone", file: !388, line: 129, size: 64, elements: !389)
!388 = !DIFile(filename: "/usr/include/sys/time.h", directory: "")
!389 = !{!390, !391}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tz_minuteswest", scope: !387, file: !388, line: 130, baseType: !26, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tz_dsttime", scope: !387, file: !388, line: 131, baseType: !26, size: 32, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !393, line: 31, baseType: !394)
!393 = !DIFile(filename: "/usr/include/sys/_types/_pid_t.h", directory: "")
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pid_t", file: !21, line: 72, baseType: !218)
!395 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !398, line: 147, size: 384, elements: !399)
!398 = !DIFile(filename: "/usr/include/netdb.h", directory: "")
!399 = !{!400, !401, !402, !403, !404, !408, !409, !411}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !397, file: !398, line: 148, baseType: !26, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !397, file: !398, line: 149, baseType: !26, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !397, file: !398, line: 150, baseType: !26, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !397, file: !398, line: 151, baseType: !26, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !397, file: !398, line: 152, baseType: !405, size: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !406, line: 31, baseType: !407)
!406 = !DIFile(filename: "/usr/include/sys/_types/_socklen_t.h", directory: "")
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_socklen_t", file: !23, line: 118, baseType: !37)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !397, file: !398, line: 153, baseType: !6, size: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !397, file: !398, line: 154, baseType: !410, size: 64, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !397, file: !398, line: 155, baseType: !396, size: 64, offset: 320)
!412 = !{!0, !413, !415, !417, !419, !421, !423, !425, !427, !429, !431, !433, !435, !437, !439, !441, !443, !445, !447, !449, !451, !453, !455, !457, !459, !461, !463, !465, !467, !469, !471, !473, !475, !477, !479, !481, !483, !485, !488, !490, !492}
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "argv0", scope: !2, file: !3, line: 72, type: !6, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "debug", scope: !2, file: !3, line: 73, type: !26, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "port", scope: !2, file: !3, line: 74, type: !137, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "dir", scope: !2, file: !3, line: 75, type: !6, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "data_dir", scope: !2, file: !3, line: 76, type: !6, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "do_chroot", scope: !2, file: !3, line: 77, type: !26, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "no_log", scope: !2, file: !3, line: 77, type: !26, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "no_symlink_check", scope: !2, file: !3, line: 77, type: !26, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "do_vhost", scope: !2, file: !3, line: 77, type: !26, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "do_global_passwd", scope: !2, file: !3, line: 77, type: !26, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "cgi_pattern", scope: !2, file: !3, line: 78, type: !6, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "cgi_limit", scope: !2, file: !3, line: 79, type: !26, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "url_pattern", scope: !2, file: !3, line: 80, type: !6, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "no_empty_referrers", scope: !2, file: !3, line: 81, type: !26, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "local_pattern", scope: !2, file: !3, line: 82, type: !6, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "logfile", scope: !2, file: !3, line: 83, type: !6, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "throttlefile", scope: !2, file: !3, line: 84, type: !6, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "hostname", scope: !2, file: !3, line: 85, type: !6, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "pidfile", scope: !2, file: !3, line: 86, type: !6, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "user", scope: !2, file: !3, line: 87, type: !6, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "charset", scope: !2, file: !3, line: 88, type: !6, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "p3p", scope: !2, file: !3, line: 89, type: !6, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "max_age", scope: !2, file: !3, line: 90, type: !26, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "throttles", scope: !2, file: !3, line: 100, type: !8, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "numthrottles", scope: !2, file: !3, line: 101, type: !26, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "maxthrottles", scope: !2, file: !3, line: 101, type: !26, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "connects", scope: !2, file: !3, line: 121, type: !248, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "num_connects", scope: !2, file: !3, line: 122, type: !26, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "max_connects", scope: !2, file: !3, line: 122, type: !26, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "first_free_connect", scope: !2, file: !3, line: 122, type: !26, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "httpd_conn_count", scope: !2, file: !3, line: 123, type: !26, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "start_time", scope: !2, file: !3, line: 135, type: !244, isLocal: false, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "stats_time", scope: !2, file: !3, line: 135, type: !244, isLocal: false, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "stats_connections", scope: !2, file: !3, line: 136, type: !14, isLocal: false, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "stats_bytes", scope: !2, file: !3, line: 137, type: !18, isLocal: false, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "stats_simultaneous", scope: !2, file: !3, line: 138, type: !26, isLocal: false, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "got_hup", scope: !2, file: !3, line: 140, type: !487, isLocal: true, isDefinition: true)
!487 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !26)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "got_usr1", scope: !2, file: !3, line: 140, type: !487, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "watchdog_flag", scope: !2, file: !3, line: 140, type: !487, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "hs", scope: !2, file: !3, line: 133, type: !187, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "httpd_err400title", scope: !496, file: !497, line: 509, type: !6, isLocal: false, isDefinition: true)
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !497, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !498, globals: !665, nameTableKind: None)
!497 = !DIFile(filename: "libhttpd.c", directory: "/Users/yongzhehuang/Library/Mobile Documents/com~apple~CloudDocs/Documents/llvm_versions/program-dependence-graph/benchmarks/thttpd-2.29")
!498 = !{!499, !6, !517, !551, !26, !70, !14, !244, !597, !599, !37, !267, !395, !18, !243, !24, !601, !56, !57, !609, !635, !636, !641, !664, !392, !106}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "httpd_server", file: !111, line: 91, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 72, size: 1088, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !545, !546, !547, !548, !549, !550}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "binding_hostname", scope: !501, file: !111, line: 73, baseType: !6, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "server_hostname", scope: !501, file: !111, line: 74, baseType: !6, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !501, file: !111, line: 75, baseType: !137, size: 16, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "cgi_pattern", scope: !501, file: !111, line: 76, baseType: !6, size: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "cgi_limit", scope: !501, file: !111, line: 77, baseType: !26, size: 32, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "cgi_count", scope: !501, file: !111, line: 77, baseType: !26, size: 32, offset: 288)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !501, file: !111, line: 78, baseType: !6, size: 64, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "p3p", scope: !501, file: !111, line: 79, baseType: !6, size: 64, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "max_age", scope: !501, file: !111, line: 80, baseType: !26, size: 32, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "cwd", scope: !501, file: !111, line: 81, baseType: !6, size: 64, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "listen4_fd", scope: !501, file: !111, line: 82, baseType: !26, size: 32, offset: 576)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "listen6_fd", scope: !501, file: !111, line: 82, baseType: !26, size: 32, offset: 608)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "no_log", scope: !501, file: !111, line: 83, baseType: !26, size: 32, offset: 640)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "logfp", scope: !501, file: !111, line: 84, baseType: !517, size: 64, offset: 704)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !52, line: 157, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !52, line: 126, size: 1216, elements: !520)
!520 = !{!521, !522, !523, !524, !525, !526, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !519, file: !52, line: 127, baseType: !56, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !519, file: !52, line: 128, baseType: !26, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !519, file: !52, line: 129, baseType: !26, size: 32, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !519, file: !52, line: 130, baseType: !61, size: 16, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !519, file: !52, line: 131, baseType: !61, size: 16, offset: 144)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !519, file: !52, line: 132, baseType: !527, size: 128, offset: 192)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !52, line: 92, size: 128, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !527, file: !52, line: 93, baseType: !56, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !527, file: !52, line: 94, baseType: !26, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !519, file: !52, line: 133, baseType: !26, size: 32, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !519, file: !52, line: 136, baseType: !70, size: 64, offset: 384)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !519, file: !52, line: 137, baseType: !72, size: 64, offset: 448)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !519, file: !52, line: 138, baseType: !76, size: 64, offset: 512)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !519, file: !52, line: 139, baseType: !80, size: 64, offset: 576)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !519, file: !52, line: 140, baseType: !85, size: 64, offset: 640)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !519, file: !52, line: 143, baseType: !527, size: 128, offset: 704)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !519, file: !52, line: 144, baseType: !92, size: 64, offset: 832)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !519, file: !52, line: 145, baseType: !26, size: 32, offset: 896)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !519, file: !52, line: 148, baseType: !96, size: 24, offset: 928)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !519, file: !52, line: 149, baseType: !100, size: 8, offset: 952)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !519, file: !52, line: 152, baseType: !527, size: 128, offset: 960)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !519, file: !52, line: 155, baseType: !26, size: 32, offset: 1088)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !519, file: !52, line: 156, baseType: !83, size: 64, offset: 1152)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "no_symlink_check", scope: !501, file: !111, line: 85, baseType: !26, size: 32, offset: 768)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "vhost", scope: !501, file: !111, line: 86, baseType: !26, size: 32, offset: 800)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "global_passwd", scope: !501, file: !111, line: 87, baseType: !26, size: 32, offset: 832)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "url_pattern", scope: !501, file: !111, line: 88, baseType: !6, size: 64, offset: 896)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "local_pattern", scope: !501, file: !111, line: 89, baseType: !6, size: 64, offset: 960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "no_empty_referrers", scope: !501, file: !111, line: 90, baseType: !26, size: 32, offset: 1024)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "httpd_sockaddr", file: !111, line: 69, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !111, line: 62, size: 1024, elements: !554)
!554 = !{!555, !561, !572, !589}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !553, file: !111, line: 63, baseType: !556, size: 128)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !116, line: 407, size: 128, elements: !557)
!557 = !{!558, !559, !560}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "sa_len", scope: !556, file: !116, line: 408, baseType: !119, size: 8)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !556, file: !116, line: 409, baseType: !121, size: 8, offset: 8)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !556, file: !116, line: 410, baseType: !124, size: 112, offset: 16)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "sa_in", scope: !553, file: !111, line: 64, baseType: !562, size: 128)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !129, line: 375, size: 128, elements: !563)
!563 = !{!564, !565, !566, !567, !571}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "sin_len", scope: !562, file: !129, line: 376, baseType: !119, size: 8)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !562, file: !129, line: 377, baseType: !121, size: 8, offset: 8)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !562, file: !129, line: 378, baseType: !134, size: 16, offset: 16)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !562, file: !129, line: 379, baseType: !568, size: 32, offset: 32)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !129, line: 301, size: 32, elements: !569)
!569 = !{!570}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !568, file: !129, line: 302, baseType: !142, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !562, file: !129, line: 380, baseType: !145, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "sa_in6", scope: !553, file: !111, line: 66, baseType: !573, size: 224)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !150, line: 169, size: 224, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !588}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_len", scope: !573, file: !150, line: 170, baseType: !119, size: 8)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !573, file: !150, line: 171, baseType: !121, size: 8, offset: 8)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !573, file: !150, line: 172, baseType: !134, size: 16, offset: 16)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !573, file: !150, line: 173, baseType: !37, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !573, file: !150, line: 174, baseType: !580, size: 128, offset: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !150, line: 151, size: 128, elements: !581)
!581 = !{!582}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr", scope: !580, file: !150, line: 156, baseType: !583, size: 128)
!583 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !580, file: !150, line: 152, size: 128, elements: !584)
!584 = !{!585, !586, !587}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !583, file: !150, line: 153, baseType: !163, size: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !583, file: !150, line: 154, baseType: !167, size: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !583, file: !150, line: 155, baseType: !169, size: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !573, file: !150, line: 175, baseType: !37, size: 32, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "sa_stor", scope: !553, file: !111, line: 67, baseType: !590, size: 1024)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !116, line: 440, size: 1024, elements: !591)
!591 = !{!592, !593, !594, !595, !596}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ss_len", scope: !590, file: !116, line: 441, baseType: !119, size: 8)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !590, file: !116, line: 442, baseType: !121, size: 8, offset: 8)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_pad1", scope: !590, file: !116, line: 443, baseType: !179, size: 48, offset: 16)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !590, file: !116, line: 444, baseType: !22, size: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_pad2", scope: !590, file: !116, line: 445, baseType: !184, size: 896, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mime_entry", file: !497, line: 2512, size: 256, elements: !604)
!604 = !{!605, !606, !607, !608}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !603, file: !497, line: 2513, baseType: !6, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ext_len", scope: !603, file: !497, line: 2514, baseType: !264, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !603, file: !497, line: 2515, baseType: !6, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "val_len", scope: !603, file: !497, line: 2516, baseType: !264, size: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !611, line: 84, baseType: !612)
!611 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !611, line: 73, size: 1088, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619, !620, !621, !622, !632}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__dd_fd", scope: !612, file: !611, line: 74, baseType: !26, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__dd_loc", scope: !612, file: !611, line: 75, baseType: !14, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "__dd_size", scope: !612, file: !611, line: 76, baseType: !14, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "__dd_buf", scope: !612, file: !611, line: 77, baseType: !6, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__dd_len", scope: !612, file: !611, line: 78, baseType: !26, size: 32, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "__dd_seek", scope: !612, file: !611, line: 79, baseType: !14, size: 64, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "__padding", scope: !612, file: !611, line: 80, baseType: !14, size: 64, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "__dd_flags", scope: !612, file: !611, line: 81, baseType: !26, size: 32, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__dd_lock", scope: !612, file: !611, line: 82, baseType: !623, size: 512, offset: 512)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_mutex_t", file: !624, line: 113, baseType: !625)
!624 = !DIFile(filename: "/usr/include/sys/_pthread/_pthread_types.h", directory: "")
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_mutex_t", file: !624, line: 78, size: 512, elements: !626)
!626 = !{!627, !628}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !625, file: !624, line: 79, baseType: !14, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !625, file: !624, line: 80, baseType: !629, size: 448, offset: 64)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 448, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 56)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "__dd_td", scope: !612, file: !611, line: 83, baseType: !633, size: 64, offset: 1024)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "_telldir", file: !611, line: 70, flags: DIFlagFwdDecl)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !213, line: 34, size: 128, elements: !638)
!638 = !{!639, !640}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !637, file: !213, line: 36, baseType: !44, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !637, file: !213, line: 37, baseType: !217, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !221, line: 65, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TimerStruct", file: !221, line: 56, size: 576, elements: !644)
!644 = !{!645, !656, !657, !658, !659, !660, !662, !663}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "timer_proc", scope: !643, file: !221, line: 57, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerProc", file: !221, line: 53, baseType: !648)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !650, !636}
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClientData", file: !221, line: 45, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !221, line: 41, size: 64, elements: !652)
!652 = !{!653, !654, !655}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !651, file: !221, line: 42, baseType: !70, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !651, file: !221, line: 43, baseType: !26, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !651, file: !221, line: 44, baseType: !14, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !643, file: !221, line: 58, baseType: !650, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "msecs", scope: !643, file: !221, line: 59, baseType: !14, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !643, file: !221, line: 60, baseType: !26, size: 32, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !643, file: !221, line: 61, baseType: !637, size: 128, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !643, file: !221, line: 62, baseType: !661, size: 64, offset: 384)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !643, file: !221, line: 63, baseType: !661, size: 64, offset: 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !643, file: !221, line: 64, baseType: !26, size: 32, offset: 512)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!665 = !{!666, !494, !674, !676, !678, !680, !682, !684, !692, !694, !696, !698, !700, !702, !704, !799, !801, !803, !805, !810, !812, !814, !816, !818, !821, !823, !826, !831, !836, !838, !841, !843, !845, !847, !849, !854, !856, !858, !860, !865, !867, !869, !874, !876, !878, !880, !882, !884, !886, !888, !890, !895, !897, !902, !904, !906, !909, !912, !914, !917, !919, !921, !923, !925, !927, !929, !931, !933, !941, !946, !948, !950, !952}
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "ghnbuf", scope: !668, file: !497, line: 236, type: !671, isLocal: true, isDefinition: true)
!668 = distinct !DISubprogram(name: "httpd_initialize", scope: !497, file: !497, line: 228, type: !669, scopeLine: 234, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !496, retainedNodes: !4)
!669 = !DISubroutineType(types: !670)
!670 = !{!499, !6, !551, !551, !137, !6, !26, !6, !6, !26, !6, !26, !517, !26, !26, !26, !6, !6, !26}
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 256)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "httpd_err400form", scope: !496, file: !497, line: 510, type: !6, isLocal: false, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "httpd_err408title", scope: !496, file: !497, line: 529, type: !6, isLocal: false, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "httpd_err408form", scope: !496, file: !497, line: 530, type: !6, isLocal: false, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "httpd_err503title", scope: !496, file: !497, line: 545, type: !6, isLocal: false, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "httpd_err503form", scope: !496, file: !497, line: 546, type: !6, isLocal: false, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "str", scope: !686, file: !497, line: 4115, type: !689, isLocal: true, isDefinition: true)
!686 = distinct !DISubprogram(name: "httpd_ntoa", scope: !497, file: !497, line: 4112, type: !687, scopeLine: 4113, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !496, retainedNodes: !4)
!687 = !DISubroutineType(types: !688)
!688 = !{!6, !551}
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1600, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 200)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "sub_process", scope: !496, file: !497, line: 193, type: !26, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "str_alloc_count", scope: !496, file: !497, line: 707, type: !26, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "str_alloc_size", scope: !496, file: !497, line: 708, type: !264, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "ok206title", scope: !496, file: !497, line: 502, type: !6, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "err501title", scope: !496, file: !497, line: 541, type: !6, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "err501form", scope: !496, file: !497, line: 542, type: !6, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "tempfilename", scope: !706, file: !497, line: 1368, type: !6, isLocal: true, isDefinition: true)
!706 = distinct !DISubprogram(name: "vhost_map", scope: !497, file: !497, line: 1364, type: !707, scopeLine: 1365, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !496, retainedNodes: !4)
!707 = !DISubroutineType(types: !708)
!708 = !{!26, !709}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "httpd_conn", file: !111, line: 148, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 94, size: 5760, elements: !712)
!712 = !{!713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !797, !798}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !711, file: !111, line: 95, baseType: !26, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "hs", scope: !711, file: !111, line: 96, baseType: !499, size: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "client_addr", scope: !711, file: !111, line: 97, baseType: !552, size: 1024, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !711, file: !111, line: 98, baseType: !6, size: 64, offset: 1152)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "read_size", scope: !711, file: !111, line: 99, baseType: !264, size: 64, offset: 1216)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "read_idx", scope: !711, file: !111, line: 99, baseType: !264, size: 64, offset: 1280)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "checked_idx", scope: !711, file: !111, line: 99, baseType: !264, size: 64, offset: 1344)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "checked_state", scope: !711, file: !111, line: 100, baseType: !26, size: 32, offset: 1408)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !711, file: !111, line: 101, baseType: !26, size: 32, offset: 1440)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !711, file: !111, line: 102, baseType: !26, size: 32, offset: 1472)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_to_send", scope: !711, file: !111, line: 103, baseType: !18, size: 64, offset: 1536)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_sent", scope: !711, file: !111, line: 104, baseType: !18, size: 64, offset: 1600)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "encodedurl", scope: !711, file: !111, line: 105, baseType: !6, size: 64, offset: 1664)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "decodedurl", scope: !711, file: !111, line: 106, baseType: !6, size: 64, offset: 1728)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !711, file: !111, line: 107, baseType: !6, size: 64, offset: 1792)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "origfilename", scope: !711, file: !111, line: 108, baseType: !6, size: 64, offset: 1856)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "expnfilename", scope: !711, file: !111, line: 109, baseType: !6, size: 64, offset: 1920)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "encodings", scope: !711, file: !111, line: 110, baseType: !6, size: 64, offset: 1984)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "pathinfo", scope: !711, file: !111, line: 111, baseType: !6, size: 64, offset: 2048)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !711, file: !111, line: 112, baseType: !6, size: 64, offset: 2112)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "referrer", scope: !711, file: !111, line: 113, baseType: !6, size: 64, offset: 2176)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "useragent", scope: !711, file: !111, line: 114, baseType: !6, size: 64, offset: 2240)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !711, file: !111, line: 115, baseType: !6, size: 64, offset: 2304)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "accepte", scope: !711, file: !111, line: 116, baseType: !6, size: 64, offset: 2368)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "acceptl", scope: !711, file: !111, line: 117, baseType: !6, size: 64, offset: 2432)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !711, file: !111, line: 118, baseType: !6, size: 64, offset: 2496)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !711, file: !111, line: 119, baseType: !6, size: 64, offset: 2560)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "reqhost", scope: !711, file: !111, line: 120, baseType: !6, size: 64, offset: 2624)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "hdrhost", scope: !711, file: !111, line: 121, baseType: !6, size: 64, offset: 2688)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "hostdir", scope: !711, file: !111, line: 122, baseType: !6, size: 64, offset: 2752)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "authorization", scope: !711, file: !111, line: 123, baseType: !6, size: 64, offset: 2816)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "remoteuser", scope: !711, file: !111, line: 124, baseType: !6, size: 64, offset: 2880)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !711, file: !111, line: 125, baseType: !6, size: 64, offset: 2944)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "maxdecodedurl", scope: !711, file: !111, line: 126, baseType: !264, size: 64, offset: 3008)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "maxorigfilename", scope: !711, file: !111, line: 126, baseType: !264, size: 64, offset: 3072)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "maxexpnfilename", scope: !711, file: !111, line: 126, baseType: !264, size: 64, offset: 3136)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "maxencodings", scope: !711, file: !111, line: 126, baseType: !264, size: 64, offset: 3200)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "maxpathinfo", scope: !711, file: !111, line: 127, baseType: !264, size: 64, offset: 3264)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "maxquery", scope: !711, file: !111, line: 127, baseType: !264, size: 64, offset: 3328)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "maxaccept", scope: !711, file: !111, line: 127, baseType: !264, size: 64, offset: 3392)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "maxaccepte", scope: !711, file: !111, line: 127, baseType: !264, size: 64, offset: 3456)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "maxreqhost", scope: !711, file: !111, line: 127, baseType: !264, size: 64, offset: 3520)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "maxhostdir", scope: !711, file: !111, line: 127, baseType: !264, size: 64, offset: 3584)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "maxremoteuser", scope: !711, file: !111, line: 128, baseType: !264, size: 64, offset: 3648)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "maxresponse", scope: !711, file: !111, line: 128, baseType: !264, size: 64, offset: 3712)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "responselen", scope: !711, file: !111, line: 133, baseType: !264, size: 64, offset: 3776)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "if_modified_since", scope: !711, file: !111, line: 134, baseType: !244, size: 64, offset: 3840)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "range_if", scope: !711, file: !111, line: 134, baseType: !244, size: 64, offset: 3904)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "contentlength", scope: !711, file: !111, line: 135, baseType: !264, size: 64, offset: 3968)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !711, file: !111, line: 136, baseType: !6, size: 64, offset: 4032)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !711, file: !111, line: 137, baseType: !6, size: 64, offset: 4096)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "mime_flag", scope: !711, file: !111, line: 138, baseType: !26, size: 32, offset: 4160)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "one_one", scope: !711, file: !111, line: 139, baseType: !26, size: 32, offset: 4192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "got_range", scope: !711, file: !111, line: 140, baseType: !26, size: 32, offset: 4224)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tildemapped", scope: !711, file: !111, line: 141, baseType: !26, size: 32, offset: 4256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "first_byte_index", scope: !711, file: !111, line: 142, baseType: !18, size: 64, offset: 4288)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "last_byte_index", scope: !711, file: !111, line: 142, baseType: !18, size: 64, offset: 4352)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !711, file: !111, line: 143, baseType: !26, size: 32, offset: 4416)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "should_linger", scope: !711, file: !111, line: 144, baseType: !26, size: 32, offset: 4448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "sb", scope: !711, file: !111, line: 145, baseType: !773, size: 1152, offset: 4480)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !324, line: 182, size: 1152, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !773, file: !324, line: 182, baseType: !327, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !773, file: !324, line: 182, baseType: !331, size: 16, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !773, file: !324, line: 182, baseType: !335, size: 16, offset: 48)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !773, file: !324, line: 182, baseType: !338, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !773, file: !324, line: 182, baseType: !34, size: 32, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !773, file: !324, line: 182, baseType: !40, size: 32, offset: 160)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !773, file: !324, line: 182, baseType: !327, size: 32, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !773, file: !324, line: 182, baseType: !783, size: 128, offset: 256)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !346, line: 33, size: 128, elements: !784)
!784 = !{!785, !786}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !783, file: !346, line: 35, baseType: !44, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !783, file: !346, line: 36, baseType: !14, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !773, file: !324, line: 182, baseType: !783, size: 128, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !773, file: !324, line: 182, baseType: !783, size: 128, offset: 512)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !773, file: !324, line: 182, baseType: !783, size: 128, offset: 640)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !773, file: !324, line: 182, baseType: !18, size: 64, offset: 768)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !773, file: !324, line: 182, baseType: !355, size: 64, offset: 832)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !773, file: !324, line: 182, baseType: !359, size: 32, offset: 896)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !773, file: !324, line: 182, baseType: !37, size: 32, offset: 928)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !773, file: !324, line: 182, baseType: !37, size: 32, offset: 960)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !773, file: !324, line: 182, baseType: !218, size: 32, offset: 992)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !773, file: !324, line: 182, baseType: !366, size: 128, offset: 1024)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "conn_fd", scope: !711, file: !111, line: 146, baseType: !26, size: 32, offset: 5632)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "file_address", scope: !711, file: !111, line: 147, baseType: !6, size: 64, offset: 5696)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "maxtempfilename", scope: !706, file: !497, line: 1369, type: !264, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "err500title", scope: !496, file: !497, line: 537, type: !6, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "err500form", scope: !496, file: !497, line: 538, type: !6, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "checked", scope: !807, file: !497, line: 1458, type: !6, isLocal: true, isDefinition: true)
!807 = distinct !DISubprogram(name: "expand_symlinks", scope: !497, file: !497, line: 1456, type: !808, scopeLine: 1457, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !496, retainedNodes: !4)
!808 = !DISubroutineType(types: !809)
!809 = !{!6, !6, !635, !26, !26}
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "rest", scope: !807, file: !497, line: 1459, type: !6, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "maxchecked", scope: !807, file: !497, line: 1461, type: !264, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "maxrest", scope: !807, file: !497, line: 1461, type: !264, isLocal: true, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "err403title", scope: !496, file: !497, line: 519, type: !6, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression(DW_OP_constu, 3, DW_OP_stack_value))
!819 = distinct !DIGlobalVariable(name: "n_enc_tab", scope: !496, file: !497, line: 2521, type: !820, isLocal: true, isDefinition: true)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression(DW_OP_constu, 193, DW_OP_stack_value))
!822 = distinct !DIGlobalVariable(name: "n_typ_tab", scope: !496, file: !497, line: 2525, type: !820, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "enc_tab", scope: !496, file: !497, line: 2518, type: !825, isLocal: true, isDefinition: true)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 768, elements: !97)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "typ_tab", scope: !496, file: !497, line: 2522, type: !828, isLocal: true, isDefinition: true)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 49408, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 193)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "indexname", scope: !833, file: !497, line: 3626, type: !6, isLocal: true, isDefinition: true)
!833 = distinct !DISubprogram(name: "really_start_request", scope: !497, file: !497, line: 3624, type: !834, scopeLine: 3625, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !496, retainedNodes: !4)
!834 = !DISubroutineType(types: !835)
!835 = !{!26, !709, !636}
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "maxindexname", scope: !833, file: !497, line: 3627, type: !264, isLocal: true, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "index_names", scope: !833, file: !497, line: 3628, type: !840, isLocal: true, isDefinition: true)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 384, elements: !180)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "dirname", scope: !833, file: !497, line: 3631, type: !6, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "maxdirname", scope: !833, file: !497, line: 3632, type: !264, isLocal: true, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "err404title", scope: !496, file: !497, line: 525, type: !6, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "err404form", scope: !496, file: !497, line: 526, type: !6, isLocal: true, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "location", scope: !851, file: !497, line: 1174, type: !6, isLocal: true, isDefinition: true)
!851 = distinct !DISubprogram(name: "send_dirredirect", scope: !497, file: !497, line: 1172, type: !852, scopeLine: 1173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !496, retainedNodes: !4)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !709}
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "header", scope: !851, file: !497, line: 1175, type: !6, isLocal: true, isDefinition: true)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "maxlocation", scope: !851, file: !497, line: 1176, type: !264, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "maxheader", scope: !851, file: !497, line: 1176, type: !264, isLocal: true, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "headstr", scope: !851, file: !497, line: 1177, type: !862, isLocal: true, isDefinition: true)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 88, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 11)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "err302title", scope: !496, file: !497, line: 504, type: !6, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "err302form", scope: !496, file: !497, line: 505, type: !6, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(name: "authpath", scope: !871, file: !497, line: 1023, type: !6, isLocal: true, isDefinition: true)
!871 = distinct !DISubprogram(name: "auth_check2", scope: !497, file: !497, line: 1021, type: !872, scopeLine: 1022, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !496, retainedNodes: !4)
!872 = !DISubroutineType(types: !873)
!873 = !{!26, !709, !6}
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "maxauthpath", scope: !871, file: !497, line: 1024, type: !264, isLocal: true, isDefinition: true)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "prevauthpath", scope: !871, file: !497, line: 1033, type: !6, isLocal: true, isDefinition: true)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "maxprevauthpath", scope: !871, file: !497, line: 1034, type: !264, isLocal: true, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "prevmtime", scope: !871, file: !497, line: 1035, type: !244, isLocal: true, isDefinition: true)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "prevuser", scope: !871, file: !497, line: 1036, type: !6, isLocal: true, isDefinition: true)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "maxprevuser", scope: !871, file: !497, line: 1037, type: !264, isLocal: true, isDefinition: true)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "prevcryp", scope: !871, file: !497, line: 1038, type: !6, isLocal: true, isDefinition: true)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "maxprevcryp", scope: !871, file: !497, line: 1039, type: !264, isLocal: true, isDefinition: true)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "header", scope: !892, file: !497, line: 899, type: !6, isLocal: true, isDefinition: true)
!892 = distinct !DISubprogram(name: "send_authenticate", scope: !497, file: !497, line: 897, type: !893, scopeLine: 898, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !496, retainedNodes: !4)
!893 = !DISubroutineType(types: !894)
!894 = !{null, !709, !6}
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "maxheader", scope: !892, file: !497, line: 900, type: !264, isLocal: true, isDefinition: true)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "headstr", scope: !892, file: !497, line: 901, type: !899, isLocal: true, isDefinition: true)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 32)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "err401title", scope: !496, file: !497, line: 514, type: !6, isLocal: true, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "err401form", scope: !496, file: !497, line: 515, type: !6, isLocal: true, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "b64_decode_table", scope: !496, file: !497, line: 926, type: !908, isLocal: true, isDefinition: true)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8192, elements: !672)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(name: "refhost", scope: !911, file: !497, line: 4044, type: !6, isLocal: true, isDefinition: true)
